[{"caption": "“There is harmony between good and bad. There isn’t one without the other, because they create meaning and meld together to form the big picture in life. We just need to learn how to navigate that.”", "image": "./photos/2251210977311985301.jpg"}, {"caption": "“In the summer of 2019, I worked abroad in Uganda as a facilitator for an undergraduate field school. My favourite part was seeing how much effort went into building community engagement. Being able to work with the students, navigate through their problems, adapt to the culture and more. Really just exploring the notion of informal engagement. Playing cards with community members and not just getting our data and leaving. I liked that we weren’t in and out, but that we actually interacted with the people that we were working with. \nMy career goal boils down to influencing health globally. I would love to collaborate with diverse people in interdisciplinary teams to use the medical and social aspects of health to address challenges in global health. \nI think global health is a complicated field, because of the history involved. When we think of working with underdeveloped countries, we have to remember that there are the historic and on-going impacts of colonialism at play. We have to be really careful about how we go about that. Not everyone has that knowledge. Lots of people have really good intentions to help but they don’t realize that they could have damaging impacts in various countries. I am very passionate about students staying away from engaging in unethical work. It’s so important for us to be culturally competent, adaptable, and justice-oriented when working with folks from diverse and often vulnerable populations.”", "image": "./photos/2243460963981835296.jpg"}, {"caption": "“Being sad is a privilege. Not a lot of people have the time to sit and reflect on how they feel. Not enough people spend that time to take care of themselves. Sometimes people assume that they aren’t sad because they don’t have time to think. \nWhen you sit and recognize that you’re sad, that’s a privilege because most people can’t. That reflection gives you time to adjust your life. That’s why I often feel happy when I’m sad.”", "image": "./photos/2236802395551431695.jpg"}, {"caption": "“I grew up in Grand Prairie and was super involved in my community. I started a leadership club in junior high, volunteered as a junior lifeguard when a new local swimming pool opened up, and I was the student body representative for my school’s parents’ association. I made money through jobs that I loved and dedicated myself to, but volunteering took a place in my heart.\n\nAfter high school, I always knew I wanted to go to the University of Calgary. I started in Social Work, but switched to Political Science. I didn’t like the way policies in general worked. I used to intern for a resource centre for people with disabilities. My job was to plan events for them, but it was difficult with all the administrative stuff that needed to be followed. I realized that the only way to change that was to change actual laws. I continued volunteering for them after my internship was done.\n\nEven now, I still do volunteer work. I volunteer for the Student Success Centre here at the university. It helped me get back on track when I struggled with my academics. I’ve met a lot of people through it, and it helps having an amazing supervisor. If you asked me at any point what I wanted to do with my life, I would tell you ‘something.’ I want to do something that makes a positive impact in other people’s lives.”", "image": "./photos/2228751484263550630.jpg"}, {"caption": "“Recently, I became a faculty member at my studio. I typically teach intermediate crews, but I’ve also done some advanced classes. It’s so rewarding to see my choreography on advanced dancers. I’ve been shadowing my favourite mentors a lot, always taking notes to see what strategies work best for me. I want the exact same experience for my students. When I have a rough day, I want those two hours to be the best two hours of my day, for me and my students. My favourite thing is to see how other people interpret their own styles. It’s a constant reminder that I need to keep growing, and a continuous reassurance that there’s something more. People around you see your growth. With school, there’s a limit to what you can achieve: you can keep getting 90s, keep getting As, and that’s it. But dance has no limit. Dance is not discriminatory. There’s no way you could join the community and not feel like a part of it.” (2/2)", "image": "./photos/2223108981253431841.jpg"}, {"caption": "“Growing up, I have always been attracted to dancing, especially break dancing. I watched a lot of dance videos on Youtube. In Grade 10, I decided to take Dance as an option. Most people in the class took it as an “easy A,” but I was there to truly learn. Sometimes, the boys in my dance class would receive more attention than me, even though we danced at similar levels. It was discouraging, but I kept going. I became very fond and passionate of this art form. In Grade 12, I received a scholarship to the dance studio I currently attend. My parents were not impressed. “A scholarship for dance is nice, but it’s not an academic scholarship!” They’re very traditional Indian parents. My dad never came to my shows. He wasn’t against it, but he didn’t find it that important either. My relatives were also hesitant. It took me 3 years to gain their understanding and support. But, better late than never!” (1/2)", "image": "./photos/2221749175162729115.jpg"}, {"caption": "“We work with partners in lower and middle income countries to address health issues, such as food security and infectious disease. We’ve worked with people from Ethiopia, Tanzania, Uganda, Nicaragua, and more. There are diseases and issues that we don’t see often in North America or Western Europe. For instance Malaria, if you travel you take antimalarials with you, and you should be fine. But if you live in Asia or Subsaharan Africa, where it’s endemic the situation is different. Access to treatment may be limited, how do you treat complications? How do you diagnose it? They don’t have the fancy technology that we do.\n\nSo I work in countries, such as Ethiopia, with students and researchers from Canada. We work with researchers, teachers and students from these countries, and teach them how to make your own equipment and tools, that are simpler and cheaper. We do not have machines, so we do it by hand. Maybe we have to use less expensive materials. We adapt the technology to fit situation. We also don’t tell them what to do, they tell us. It’s an equitable partnership. We give, they give. We learn from them, they learn from us. Our goals of tackling health issues are the same , it’s the resources that are different. Here, we always complain about not having enough money, but you go there, and you see what not having money is really like. You also see what you can accomplish with very limited resources, and how dedicated and creative they are with limited resources. It makes you realize that we can learn a lot from them.” (2/2)", "image": "./photos/2212238555098864289.jpg"}, {"caption": "“I never thought I’d be where I am today. I thought I’d just be a researcher working in a lab. However, opportunities came along and people said 'Hey, you should try this! It is different and you can make a valuable contribution!’ One of my professors told me, 'do something different. Don’t do what everyone else is doing. First of all, you would be bored. Secondly, you can make a difference, even if it is a small one.'” (1/2)", "image": "./photos/2211461866844555027.jpg"}, {"caption": "“There was this one day where she asked ‘why can’t I run like other kids?’ and I guess the impact of the disease doesn’t really start to hit until she realizes it herself.\n\nOur routine starts daily with the massage, and then she goes to a vibration machine that helps her build and relax her muscles. And then later at night, she is once again in pain… Her knees are in pain because she tries to walk, and her muscles pull her back. \nI’m not able to work because I have to be at home with Ariela to assist her. She needs help with going to the washroom and getting dressed. We have to bring a walker anywhere we go where we expect to walk a long distance. This is due in part to the lack of physiotherapy, which she needs to have three to four times weekly. However, AHS only provides physiotherapy two to three times per month, and since I cannot work, my husband has to work to pay for it. I think it could be a lot easier if having a disease like PVL was normalized within society. ”", "image": "./photos/2209173363699954852.jpg"}, {"caption": "“It kinda just hit me in my first year. My niece, Ariela, was diagnosed with Periventricular Leukomalacia (PVL), also known as Cerebral Palsy when I had just started university, and it changed everything for me. My family and I had no experience working with a situation like Ariela’s. I grew up with my younger brother, and he was able to do things that she couldn’t, which made the experience new to me. Ariela can walk by herself, however it is really hard for her to balance. Her muscles pull her back, so she can’t really do much by herself. Even my younger niece runs around. Something else that really puts a bit more pressure on me is that [the rest of the family and I] don’t want her to feel left out, so we constantly come up with creative solutions to daily tasks that are easier for her to perform.\n\nAriela’s condition truly put things into perspective for me. I’ve always been super empathetic, but it made me realize that there are so many different things you would put everything else aside for. I now better understand that there are always things going on in people’s lives besides school. It was hard at first because school was my priority, but she was also my priority. I started Ariela’s blog, but I also had midterms, and projects, and quizzes. Now that I’m in my second year, I have figured out how to better balance my time. I just want the best for her, and the best for my schooling.”", "image": "./photos/2205550046040296719.jpg"}, {"caption": "“I don’t think poetry is an exclusive thing. I know a lot of people who write poetry but don’t tell others about it. It’s a great outlet, though. I remember back in Grade 8, my English teacher showed a spoken word video by Sarah Kay in class. That sparked a light in me. My school did some small spoken word events and I participated and got some good feedback. When I started high school, I suddenly stopped writing for 2 years. One of my friends created an Instagram page dedicated to my poetry. She posted some of my poems there and encouraged me to keep going. That’s what really got me back into poetry. I then participated in my first city-wide event and won first place! It was a pretty big deal to me because all this time, I really thought I wasn’t good enough. I am now the president of the UCalgary Spoken Word Club. Sometimes, people come to our events and get inspired. My writing is very inspiration-driven. Poetry is a very vulnerable art form, like standing naked on a stage. You just have to come to terms with that. When I’m on the mic reading poetry, I’m confident all of a sudden enough to make jokes. Being involved with it has made me confident in many aspects of my life.”", "image": "./photos/2195441771856836913.jpg"}, {"caption": "“In the past, I struggled a lot with my identity. This was partially because my parents both immigrated to Canada from Nigeria. Growing up, I felt a disconnect between my parents’ expectations of me adopting Nigerian culture and figuring out my own identity as a Nigerian Canadian. \nI think having only attended majority white schools has impacted my struggle with my identity because it was hard to find ways to fit in when I didn’t see others like myself around me. I even went as far as straightening my hair in hopes of fitting in. It was difficult trying to explain to my parents all that I was going through since they grew up in a culture that was so different from the one I was raised in. I think this is something a lot of second-generation immigrants can relate to.\nBecause of my experiences, I became interested in understanding how identity and culture can impact peoples’ worldview and perception. This is why I chose to pursue a concentration in Sociology. Currently, I’m working with organizations that work with immigrant youth and other marginalized populations because there are a lot of cases where our voices and experiences aren’t heard or taken seriously. I want to ensure that our voices can actually make an impact by using the skills and insight I’ve gained from my own experiences and hearing from others.”", "image": "./photos/2193309916378544124.jpg"}, {"caption": "“Music and dancing is a huge part of my culture. We celebrate traditions like weddings by playing music and dancing together. I guess music has been a part of my life forever; it even helps me through university. When I’m stressed or studying for exams, I play the flute or the baglama to de-stress. When I feel better, I go back to studying with a clearer mind, ready to tackle my lab reports and lecture readings.”", "image": "./photos/2191124038398824885.jpg"}, {"caption": "“Back in July, I went to Uganda for one of my medical electives. My best memory there was when my friends and I were asked if we’d like to give a speech about basic hygiene and menstrual health to some students in an all-girls school in a rural village. We jumped at the opportunity and prepared to make it as engaging as possible. We were expecting a class of 30, but when we arrived there were almost 1500 girls! We got so nervous once we looked at the crowd. It was a lot of people. I mean, who are we? But everyone was so interested in what we had to say.\n\nWe knew the presentation had to be tailored to their culture. The information had to be based on what was common to them. We learned that tampons tended not to be appropriate for cultural reasons, and pads weren’t as universal an option for all girls due to price. They use cloths instead. We talked about how to keep their cloths clean and things like that. Three of the five of us who presented were males, but we made a strong statement when we stood alongside our fellow women, talking about menstrual health. Periods aren’t something to be ashamed of. They are normal. \nThe enthusiasm of all the girls was incredible. They were so happy for the education we gave them. They sang a song for us, all 1500 of them at once. That gave me chills. It really showed we were able to make a positive impact.”", "image": "./photos/2189659105819846897.jpg"}, {"caption": "“My mom runs her own daycare business in our home. It was nice when I was little because I always had friends to hang out with, but as I got older it became a bit of a struggle. It was sometimes difficult to invite friends over during the day or have sleepovers because it was so busy. I had to go through my most awkward and challenging years with little kids looking up at me. Living in a day home was exciting though, and it’s neat to see kids I watched grow up now graduate. The hardest part about it was that I wasn’t always able to talk to my mom. We were either being interrupted or she was too tired after such a long day. Thankfully, she found ways to make time for me.\nMy mom is my best friend and I don’t go a day without talking to her. She’s the first person I call when I’m excited or upset, and she’s been there for me during my darkest times. Throughout my teens I was in a really unhealthy place mentally, to the point of hospitalization. During those times she would wake up at 3AM every night and open my door just to make sure I was okay. Sometimes, she would even sleep beside me. She also helped me when I decided I wanted to lose weight. Losing 70 pounds is my biggest accomplishment, and we embarked on that weight loss journey together.\nMy mom is the example of kindness and compassion. She loves everyone and is always giving so much to others that sometimes she forgets to give to herself. We are very much alike in that sense, but together we are learning how to take care of ourselves.”", "image": "./photos/2180190921903353341.jpg"}, {"caption": "“I tend to see myself in TV and movie characters. I watched Legally Blonde and it made me want to be a lawyer. I watched Brooklyn Nine-Nine and I wanted to be a cop. I watched House M.D. and that made want to become a doctor. I’m in neuroscience, but as you can tell, I’m easily influenced by what I watch. I really related to Elle Woods’ struggle in Legally Blonde – I took issue with people not taking me seriously. Proving people wrong is something that drives me, like when I graduated with a full International Baccalaureate diploma even though my junior high school teachers wouldn’t recommend me for IB. A lot of people think I’m dumber than I actually am. I’m not dumb. I’m just moderately dumb.”", "image": "./photos/2176589729088645493.jpg"}, {"caption": "“There was no way for me to prepare myself for what I experienced in Uganda. You never really know what you’re getting yourself into until you’re in it. My family was worried about me going, but I think this really speaks to how biased we are when we talk about Uganda, and African countries in general. The narrative surrounding Africa tends to be quite negative. I didn’t want to perpetuate this view so I knew I needed to go see it for myself.\n\nThere’s so much diversity in Uganda. I was blown away when I learned that most Ugandans can speak four or five different languages. But what sticks with me from my time in Uganda are the strong connections and friendships I built, and just how nice the people are. People who say Canadians are too polite definitely haven’t met someone from Uganda.” (2/2)", "image": "./photos/2170066566506803049.jpg"}, {"caption": "“I was fortunate enough to do an internship with Healthy Child Uganda for 4 months to work with local professionals as part of the Queen Elizabeth Scholars Program, which allows for students to complete an internship in another country with a focus on social impact. The whole experience was life-changing. It was only supposed to be for 3 months but I enjoyed it so much that I decided to extend it.\n\nMy supervisor was very supportive and encouraged me to explore my interests and conduct my own project. I analyzed data and made a presentation on the village health team’s income-generating activities. These projects aim to further economic development and are spearheaded by community health workers who also balance the enormous responsibilities of providing healthcare to an entire village. In my research, I found that, despite traditional gender roles, women who participate in these projects gain respect and that profit generated is used to support the most vulnerable members of the community.\n\nBefore I went to Uganda, during the application phase, I was unsure about what I was getting myself into. I wondered if it was even ethical for me to go to Uganda as a student without any professional skills. I was unsure of how I could contribute to the organization. Knowing about the issues associated with development work, I kept wondering how I could have a positive impact while limiting the possible harm, especially as a white Canadian. I came to peace with the fact that I am only there to listen and learn. There are times for me to listen, there are spaces where I can voice my opinion, and there are spaces where I’m not welcome at all – and that’s totally fine.” (1/2)", "image": "./photos/2167854422075719771.jpg"}, {"caption": "“Attitude is so important. I’m technically in my 4th year but its my 3rd year at school since I did co-op. It is a bit difficult merging back into the same position I was two years ago. Full year of work into full time classes. It's like being first year again. I’m more focused on studying this year, which is very different. And of course it is a bit difficult being a year behind some of my friends in classes, but I find in business we do group work a lot, and my experience working for a year has given me more courage so I take initiative in groups where I am not only comfortable with my friends.\nIt has always been important to surround myself with people who support me and help me grow, as it has set me up for success. Those around me have helped to shape my actions. I’ve seen a lot of different perspectives, in particular, I am a community advisor at U of C. I’ve seen both commuter life and residence life. Both perspectives have allowed me how I fit into the bigger picture, as well uni is a much more open space for thinking as opposed to what high school was for me, and I like it.”", "image": "./photos/2164987200592485699.jpg"}, {"caption": "“I’m very passionate about music. I play piano and guitar. I picked up playing piano when I was quite young, but the guitar I started playing on the side just for fun. For me, they’re very different. The different feelings and emotions that I can express makes them incomparable. While I’m playing guitar, it’s very personal and feels like I’m writing a diary entry. However, when I play piano, it’s more like I’m writing a fairytale, taking me far away.  Knowing how to play both has really helped me understand and connect with myself and others better.”", "image": "./photos/2162101871090870205.jpg"}, {"caption": "“I was so nervous about going to university when I was in high school. I didn’t think I was “uni material.” I didn't know how I was going to survive. I was a ball of anxiety. I’ve always been very school-driven, so when classes started, I was already stressing about midterms and finals. During the first week, I would get lost just trying to find the rooms. It was confusing to have to find all the information by myself. But once I did it, it was liberating. I get to study the subjects that I choose. I have breaks here and there. I like it better than high school because I create my own schedule. But I really do hate the tiny desks here! I was actually so worried about tests that when I took the first one, I realized that I had overprepared. If I could give my younger self any advice, it would be to just chill out.”", "image": "./photos/2162002002011604471.jpg"}, {"caption": "\"Part of being human is to have the humility to recognize where you went wrong. Everyone must be open to constructive criticism. No one is perfect.” (2/2)", "image": "./photos/2161361616398317963.jpg"}, {"caption": "“Ọmọ ti wọn bi ti wọn kọ  tọtun tun ararẹ kọ. This is a saying from where I am from. It means that the child they gave birth to and trained must continue to train himself. For me, growing up means continuously improving, continuously learning, and continuously following your own voice. Do not be afraid to speak up about what you believe in. People may not have as much freedom of speech as we portray. We might think that we are not free to express our ideas or beliefs because we are afraid. We fear judgement. We make a simple comment and people get offended. We express our opinions and everyone gets mad. In the end we should ask ourselves: whose judgement do we value the most?” (1/2)", "image": "./photos/2161046166468575985.jpg"}, {"caption": "\"I’ve cherished my mother the most since I was a young age. Over the years, our bond has grown stronger and I think it’s because I’ve been able to share more with her, and also because I have grown as a person. I feel I can openly share who I am with others, especially with my mom. Even though we don’t see each other as much, I think our bond has grown stronger. She encourages me, supports my decisions, and I have learned about the importance of family ties, patience, love, life, and the art of letting go. We both understand the importance of letting go even when you love someone, because that love never dies and we’re always there for each other regardless.\"", "image": "./photos/2154816535776211345.jpg"}, {"caption": "Irf Moledina B.Comm 2008 “What I miss most about university is the freedom to do anything. The courage and support that comes with a student card. And the environment of motivated people. For me, life became what my life is today from those years. I set a world record with my friends playing cards for the longest consecutive time, I became President of Enactus, and I made a lot of my friends who eventually became my clients. My advice for students and soon to be graduates is not to be set in any particular path: instead create a path for yourself. A lot of people want to make sure that they’re in the right spot on day one. If you keep your eyes open for opportunities, they will come. Don’t bounce around. Make a decision. But be flexible to move.”", "image": "./photos/2151892977836181719.jpg"}, {"caption": "“I was seventeen when I joined the National Cadet Corps in India. There was no proper army training for it, but we did have to do a few hours of service. During drought season, the cadets went to areas that the government had not been able to reach yet. I remember a time when we went to a farm because they had a water shortage. The truck that was supposed to transport the water broke down, so we had to move buckets of water using carts. At the end of the day, it took little effort working as a group, but it helped a lot of people. That was one of my proudest moments.”", "image": "./photos/2150563975670458903.jpg"}, {"caption": "“You know that quote by Marianne Williamson about our deepest fear? It goes, \"Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure.\" I have heard it before, years ago, but I didn't really live by it until the moment I fell in true reverence of my own capabilities. \nOn the first day, we had an ice breaker activity, where we wrote down the two places we dreamed of visiting anywhere in the world. First, I wrote down the country I have always found fascinating, China, and second, the place I had seen on ads to be the most beautiful, Thailand. But I am not really somebody who looks forward to vacations. I know myself, and even on vacations, especially long international vacations, I would just lament all the work I should be doing instead. So even in this casual game of dream vacations, I chose my dream countries of China and Thailand within the context that one day, years later maybe, when all my best-laid plans fall into place, then my dream career at the United Nations would send me here. \nThe rest of the NEW conference was invigorating with the keynotes and fellow attendees reiterating the message of being bold about your dreams. Bold is not waiting around for things to fall into place with time, or passively wishing someone else would advocate for you. Bold is taking chances, sometimes not with the most spectacular level of preparation, but having grit and making sure you’re never dreaming of achievements more than you are working for them. Be bold. I was galvanized and I did just that. Only months later, when I was on the plane leaving China on our way to Thailand for the United Nations headquarters, did I then really start to fear, if I already accomplished these things now that I had previously given myself years to do, then who am I to be stopped? What now? What to do now with my long carefully laid plans which really - served to prolong, and disguise the truth that I just needed to be bold? \nNot to say that I am out here changing the world everyday, but I have peace of mind in knowing that I am already the person I need to be to deserve the accomplishments I dream of, but it's on me to be bold.”", "image": "./photos/2149781103367827696.jpg"}, {"caption": "“People in South Sudan have lived in a centre of conflict for decades. Although there are glimmers of hope, it’s a very challenging place to live. And the world doesn’t seem to notice because it has been going on for so long. So there are people like these doctors who do work behind the scenes with very limited support. And there’s still conflict going on. It’s ongoing. It can be really discouraging for them and they stay and they do what they can. \nThe doctors do what they can, but what’s important to them is their children. Sometimes the doctors aren’t even paid. That’s why we started the Sudan scholarship fund. We can’t pay their salaries, but we can support them so they can support their children. We’ve had a relationship with the doctors for well over 10 years. So it’s gone from in class to in field to helping their children receive education.\n\nWhen I had my first child vaccinated it dawned me that there were mothers around the world who wanted the same for their children, but didn’t have that privilege. I realized that mothers everywhere have the same goal: for their children to be healthy and reach their full potential. A mother in Tanzania wants the same thing; they just don’t have the same access to resources as we do.” (2/2)", "image": "./photos/2146881902052995877.jpg"}, {"caption": "“There’s been civil unrest in Sudan for decades. When I got involved in U of C’s Global Health program, children were being recruited as child soldiers. Leaders knew that they could lose an entire generation this way, so they sent some children off to Cuba to receive education and be safe. \nAfter the students finished school, the civil war was still happening. It wasn’t safe to return. The United Nations High Commission for Refugees asked other nations to take the students, which Canada did. The students lived in Canada for the next few years. They worked in other fields since they lacked qualifications needed to work in the Canadian medical system. \nIn 2006, a peace treaty was signed in Sudan. Many of the former students decided to return. They knew their medical skills would be rusty, so they asked for an upgrading program. The U of C made a nine-month full-time program for these students. Professors and physicians volunteered to teach them. I recruited volunteers, arranged for courses, so these students could return to med school in south sudan. We also did medical programs in South Sudan, in hospitals, and we also provided volunteers who provided teaching and instruction. It’s now called the Sudan Physician Reintegration program.\n\nOn one of my trips to South Sudan, we stayed in tents and set up a clinic for the nearby rural communities. We woke up one morning to see 100 people lined up to see the Sudanese doctors and the University of Calgary volunteers who had come.\n\nThe doctors could have stayed in Canada and led very comfortable lives—not working as doctors, but much more comfortable than living in Sudan. But they chose to go to South Sudan and serve their people. I was struck by their dedication and sense of service.” (1/2)", "image": "./photos/2146090446937739540.jpg"}, {"caption": "“If you told me in high school that I was going to be a flight attendant, I would have never believed you. About two years ago, I left university for two months of training with Air Canada, and then I was based in Toronto for the following five months. I traveled to London, Paris, Los Angeles and I saw so much of the world that I had never seen before. My favourite trip so far has been New York. There was so much culture to explore and I never ran out of things to do. The people there were so welcoming and they always wanted to know where I was from. Once they figured out I was based in Toronto, they also wanted to know a lot about Drake! \nI’ve transferred back to Calgary now, which limits most of my trips as domestic. But at least this way I can finish my Anthropology degree at the U of C. It’s challenging to travel and go to school at the same time but, fortunately, my job is flexible and allows me to work weekends. I find that it’s actually a nice break from academics. One downfall of my job is that I will be graduating later than expected. But to be honest, that’s okay because the experience I gain from this cannot be taught in any of my courses. I am more confident and know myself and my values much better than before, which allows me to be more decisive in university and my personal life. Being a flight attendant has made me more open to opportunities around me, especially because I would’ve never seen this one coming. I am so glad I went for it.”", "image": "./photos/2142670168211735176.jpg"}, {"caption": "Fall semester is just a couple days away now, and we hope you're ready for a whole new season of stories, events, and new projects! To help make all those things happen, we're looking add new members to our photojournalist team! \nIf you want to meet new people, are interested in photography/videography, and want to help create a healthier campus community, we want to meet you! \nLearn more at the link in our bio!\n\nApplications are due September 18th, 2019 @ 4PM.", "image": "./photos/2124133959151662262.jpg"}, {"caption": "\"One memory that stuck out to me during the TEDxYouth event was a girl pulling me aside, and asking ‘What made you decide to organize this?”. This short question turned into a five-minute conversation, then a ten-minute one, and eventually it took up my entire lunchtime. When we were talking, her friends started crowding around us, asking more questions. It started with two, then four more came by, and all of a sudden, a two-person conversation turned into a massive community conversation. I vividly remember when I left the conversation, it didn’t stop. More and more people started gathering around and voicing their opinion passionately. I turned back to look at this scene, and thought to myself: ‘this is why I am doing what I’m doing’. My ultimate goal of organizing this event is to start the conversation. I want to ignite the initial spark about issues that need to be talked about. As long as you can change one person in the event, and that person goes out to change more people, it can create a ripple effect of positive influence. It is this small percentage of conversation starters who extracted a high level of value from our event that makes all the behind-the-scenes work worthwhile.\" (2/2)", "image": "./photos/2085995980449607489.jpg"}, {"caption": "\"I think the biggest barrier of youth involvement is the fear of rejection, and the reason I started this TEDx Youth event is to inspire youth to overcome this barrier.\nMany people think that sharing ideas is a waste of time if you get nothing in return. But I wonder, what’s so bad about someone saying ‘no’? When my friend was about to give up on reapplying for a license to host a TEDx event, I told him that I will reapply. My first application was rejected, and I was about to give up as well. But, intuition told me to reapply. After another five-month-long re-application process, I finally got it. I think there is nothing wrong with getting rejected because you get more input and you’ll know exactly what to improve on when you try again, and at that point, you are a step ahead of where you started initially. As long as you think your idea has the potential to change your life or someone else’s, share it! The first step can be as simple as telling your best friend or someone you trust.\" (1/2)", "image": "./photos/2084744070706889984.jpg"}, {"caption": "What was an experience where you heard positive affirmations for being LGBT+?⁣ ⁣\n“Meeting other trans people. They’re like your found family, you know? People who share the same experiences and emotional journey as you. You have emotional roles that your family can’t fill and you end up replacing them. That’s why 'found family' is so important in queer culture, because when we choose to stay true to who we are, we lose a lot. I came out to my parents at eighteen and I was kicked out. So finding new family is our way of building up after that.”⁣\n⁣\n“Yeah. I was kicked out recently, when I came out to my family. ‘Found family’ means I have a place to live. I have a few dads. I have a few moms. My caseworker is my mom. My friends are my dads. Positive affirmations though, I remember in high school, I made friends with two people that I thought were cool. I didn’t relate to a lot of people at my school. I just made friends with two people that I liked. And both of them ended up being queer! We had no idea. We were friends for like, three years before we realized it. One of them was gay, one of them was bi, and I’m a gay trans guy.\" (3/3)⁣\n⁣\n.⁣\n.⁣\n.⁣\n⁣\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month 🌈", "image": "./photos/2078726231361566246.jpg"}, {"caption": "“In media there are queer representations such as the gay artist, gay actor, gay musician, or gay fashionista, etc. In some industries, it’s very normalized and accepted. If you ask people to name a gay scientist they wouldn’t be able to. But, Alan Turing. Ben Barres. We’re out there. But it isn’t as accepted. I’m in a STEM degree and the culture can often feel hostile toward LGBTQ people. The reality is, most of my friends who are queer and who are nurses, engineers, or in medical school…they’re afraid, we’re afraid to be us.”⁣⁣⁣\n⁣⁣⁣\n“I’m also studying STEM and there’s definitely this culture of joking around about gay people that alienates queer students. It makes you wonder how working in these industries will be. At the extreme, there’s a fear of losing your job. But even if you don’t lose your job, you don’t want people to just see you as ‘the gay one’ or discredit your work because of your gender expression.”⁣⁣⁣\n⁣⁣⁣\n“There’s fears like, if you’re in a same-sex relationship, can you have a picture of your family in your office? Or if you’re out at your workplace, will you be passed over for promotions? I fear that young people will sacrifice their career ambitions, because they don’t feel like there’s a place for them. I think it would be significant to the community to be able to come together over this. It’s important for our university community to know that if you’re out there, and you’re in science, engineering, or anything like that, and you are LGBT, there’s a place for you.”⁣⁣ (2/3)⁣\n⁣⁣⁣\n.⁣⁣\n.⁣⁣\n.⁣⁣\n⁣⁣⁣\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month 🌈", "image": "./photos/2076471963795557184.jpg"}, {"caption": "What was your first exposure to queer culture?⁣⁣\n⁣⁣\n\"Just being alive, man. And the Internet, which was especially important for me since I didn’t have any queer people to look up to. It would have been dangerous to be out at home. I turned to the Internet when there was nowhere else.\"⁣⁣\n⁣⁣\n\"I can’t remember my first experience of queerness. But I remember one summer, I was on vacation with my family and I had recently come out to myself as trans. I was trying to deal with it. And my family just casually started talking about the deaths of multiple trans women who had been assaulted at a club. They said that they deserved what they got. I just remember standing there in the kitchen, eating doughnuts, and listening to my family talk about this horrible thing.”⁣⁣\n⁣⁣\n“My first exposure to anything LGBT-related was my parents mentioning that gay people are going to hell. I must have been, like, seven? In my language, there was no word for what I felt, no cultural frame of reference. But that didn’t stop me from feeling at a very young age that I was different. Those comments, they are so powerful and you internalize them. When you’re young, your parents are everything to you. All you want is to be loved and supported by them. When you hear comments like that from them, it instantly breaks your trust. You know that they would reject a fundamental part of you. From that moment on, you realize that you aren’t safe, that they’re not going to protect you. It’s a feeling of very profound isolation. I felt not only alone, but endangered, even when nothing dangerous was happening.\" (1/3)⁣⁣\n⁣⁣\n.⁣⁣\n.⁣⁣\n.⁣⁣\n⁣⁣\n⁣\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month 🌈", "image": "./photos/2074985187121682712.jpg"}, {"caption": "\"A lot has changed since junior high. Since then, I’ve started telling people I have two moms and I know it’s not a bad thing.\n\nMy moms are still really cute together. They constantly do nice things for each other. They celebrate “month-saries.” For their twelfth anniversary, my stepmom calculated the number of seconds that she had loved my mom for.\n\nMy family is really, really close. They’re my family and my best friends. I tell them everything,  and we have so many traditions together. We go to wing night every Wednesday. We go to the gym together. I’d say it’s no different from having a typical mom and dad. To me, family means loving someone no matter what. You’re there for them forever. It’s eternal. You know you love someone when you’re at peace in your heart and you know you’re safe. You just know. And I think my moms just knew.” . (2/2)\n.\n.\n\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month 🌈", "image": "./photos/2071389432540699104.jpg"}, {"caption": "“When I was in junior high, my class had a debate on legalizing gay marriage. One of my classmates said he would kill himself if he had two dads. Since I have two moms, it just broke my heart. I started crying. I told everyone that I have two moms, that I turned out fine, and that there was nothing wrong with me or my moms. I ran out of the classroom. Before that, it had been a secret, so in a way I “came out” to the entire class. Another teacher saw me and asked me what was wrong. I told her what happened, and she helped me by saying that there was nothing wrong with my family, that it’s just something that makes me unique, and that I don’t need to be affected by other people’s words.” . (1/2)\n.\n.\n\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month 🌈", "image": "./photos/2069869398785792720.jpg"}, {"caption": "\"Coming out when I was fifteen was a difficult experience for me. I grew up in a very small town where everybody knew each other, and transforming from being “just like everyone else” to being “different” changed my life. There was a shift in how people treated me, like I wasn't welcome in certain spaces. A lot of people became more hostile towards me because they started seeing me in a different light. People also became interested in me due to this difference, rather than for who I am. Every time I entered a new space, I would have to choose how much of myself to reveal, worrying about my safety or comfort. Rather than becoming angry and feeling alone, it sparked my interest in understanding and celebrating similar differences in others. \nStudying sociology gave me the tools to hone this interest; how we are affected by so many different sociocultural factors, and how intersectionality explains many of these overlapping factors. It connected me with how stories can be healing, and empowered me to tell my own. Ultimately, being gay was the best gift that was ever given to me. It put me on a path that has brought me so much happiness and understanding that I would have never experienced without it. I might still live on a farm in that same town, and that would have been a drag.\" .\n.\n.\n\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month 🌈", "image": "./photos/2068621922883993662.jpg"}, {"caption": "“When you’re bi it’s easy to just stick to the ‘normal’. Growing up I didn’t want to cause any chaos or drama around myself. During a game of truth or dare, I had a huge mental breakdown because I realized I wanted to kiss a guy. My friend noticed and after hours of talking, I finally told her. I never planned on that happening. Once I moved away from my town, once I started university, what I realized was that it was easier to come out to people I had known for a shorter amount of time. So I began to tell people - but I would list down the people I told and where I told them. I took it very seriously, and if anyone else found out I would start questioning everything and panic. Once I told my parents though, it felt like a weight was pried off my shoulders. Because when you finally tell the people that mean the most to you, and they accept you for you, it means the world. At the end of the day, we don’t choose who we fall in love with and there’s nothing we can do about that. That’s just how we were born.\n\nAs time went by, these conversations about my identity and the LGBT community got easier and easier. Slowly bit by bit, I started being true to me. I started the Business Pride Club not only because it needed to be done, but because I really wanted to continue this conversation. I stumbled onto a boy who I fell for immediately, and three years later we’re still together. Being true to who I am has transformed me into the person I am today.” .\n.\n.\n\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month 🌈", "image": "./photos/2064771615758289298.jpg"}, {"caption": "\"It took a long time to come to terms with my sexuality. A while ago my dad had asked me if I was gay. I completely denied it back then. But two years ago, I told him everything, and surprisingly, he told me he already knew! My mom on the other hand still thinks it’s a phase. She’s still a little hesitant whenever I bring it up, but she’s slowly becoming more understanding. She attended the Pride parade last year and I can see that she’s truly making an effort to make sense of who I am as a person. Underdeveloped countries have a lot to learn regarding gender and identity. Seychelles is slowly becoming progressive with time. \nTo young girls who are conflicted, know that the internet is your best friend sometimes. Check out your Plan Parenthood clinics and other places similar to the Q-Centre. It’s okay to come out to someone other than your parents at first, if you think they’ll give you more support. Just take it one step at a time. My parents were very conservative and thought differently, but try to gauge how your parents will take in this new information. Just communicate and help them learn, because at the end of the day, they simply want the best for you. Tell them about yourself in small doses now and then. Maybe you’ll be surprised by how much they already know.” (2/2) .\n.\n.\n\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month! 🌈", "image": "./photos/2060674467878020895.jpg"}, {"caption": "“In the Catholic community, being LGBTQ+ is taboo. I’ve struggled a lot with my identity 'cause of that. Where I’m from, Seychelles, it’s not okay to be gay. My family used to tell me that people that were gay were possessed. Even when I went to Catholic school, they would promote anti-LGBTQ+ rhetoric, and I was really confused by that. I questioned my faith and sexuality a lot, but I was never able to talk to anyone about it. When I would try to bring up the subject amongst my peers, they would just insist that I was being gross. I had never met anyone else like me in Seychelles, and it made me think that there was something really wrong with my head.\n\nWhen I came to Canada, I finally found my freedom, and let go of the negativity around me. With that, I also let go of Catholicism. At that time, I came to the conclusion that my religion was wrong and my identity is beyond the mold they are trying to shape me in. All of this changed when I started volunteering at the Q-Centre and participating in activities at the Faith and Spirituality Centre. I found others just like myself and I managed to stumble into Catholicism again. I realized that God is loving and accepting regardless of your lifestyle. Yes, I’m queer and Catholic. So what?” (1/2) .\n.\n.\n\nIn celebration of International Pride Month, Humans of UCalgary wanted to bring a voice to the LGBTQ+ community of UofC. During this month we will be showcasing a few of these individuals’ stories to shed light on the lives and perspectives of LGBT folk and those around them. Humans of UCalgary will not tolerate any hate on these posts. Instead, please spread and share the love this Pride Month! 🌈", "image": "./photos/2059250562378435056.jpg"}, {"caption": "“I have a lot to be proud of. I’m proud of myself for doing something selfless – interacting with new people and learning a new way of life. After high school, I took a gap year and instead of working and making money, I decided to volunteer at a school for special needs kids in the U.S. I lived with the kids and got a sense of belonging there.\n\nI am also proud of myself for making the decision to study abroad. It was like Adulting 101 but extra hard: setting up a bank account and signing tons of paperwork to register as a resident and sign up for classes, all in German. It was a struggle doing all of life’s basic skills in another language and country. With this experience, I learned more about what I wanted to study in university. I discovered that if you don't over-plan and force things, it becomes easy to see what in life is meant for you and what isn’t.”", "image": "./photos/2040273620551675641.jpg"}, {"caption": "“I’ve been thinking a lot about the recent terrorist attack in New Zealand ever since it’s happened. Although I don’t know the victims personally, I feel as if I’ve lost brothers and sisters. But I think they are in a better place now. Muslims are sometimes portrayed by the media negatively, such as being uncultured or being a fascist, but the true values of Islam are peace, forgiveness, and kindness. I remember reading about the shooting: an elderly man stood at the door, welcoming everyone to the mosque. He said “As-Salaam-Alaykum,” which means peace be upon you, before the shooting happened. The incident attempted to divide us, but instead, the world has come together and shown more love. I also read about New Zealanders who stood around the mosque and guarded it after the attack. A lady from New Zealand came to my mosque and personally apologized for what has happened and explained to us that her country is not a place where Muslims should feel unsafe. In a time like this, I want to educate others about Muslim culture. I want to treat other individuals with respect and kindness, and hold my head high with dignity regardless of how the media has inaccurately portrayed my religion.”", "image": "./photos/2038246669574009925.jpg"}, {"caption": "Susan Smith Bachelor of Nursing (1975) & PhD Education (1995) “Latin America had always seemed like such a dark continent with its history of revolutions. When I was 42 years old, and just beginning to learn Spanish, I ended up in Mexico, recovering after finishing my doctoral studies. Friends invited me to join them on a visit to a rural village in the mountains of northern Guerrero. The poverty and malnutrition were obvious - anyone could see that. After a lot of deliberation and visits, I worked with two colleagues to start a project in that village in ‘97 with a budget of only $75/month. It took us three years of regular visits and doing small ‘bridge activities’ to get a foothold in the village and to start programs.\n\nThen the shock came: our routine water samples came back with arsenic and lead. This discovery started us down a long road of investigation: lead in their clay cooking pots; multiple nasty metals in the dyes used to colour the palm used to weave baskets (their main economy); lead and arsenic in the soil. It was like putting together a complicated puzzle - one question led to another - and slowly figuring out the causes of the villagers’ health and social problems.\n\nTo be truthful, over the past twenty years of this work in Mexico, I got fed up at times with all the problems, had so many doubts, and could have walked away, but I didn’t. The marginalization and toxic state of this Indigenous community was so wrong. Reflecting about the meaning of years of experience in such a difficult place, I realized it was a microcosm of our global problems. As societies, we all struggle now with environmental degradation, toxins, violence, loneliness, racism and resentment, and must find solutions. There’s lots that I don’t like about this macho place, but I’ve also learned about survival, as human beings and as an organization. Others tell me, “Oh Susan, you’re so stubborn,” or “You are so optimistic”, but really this work is about courage, resolve and persistence.” (2/2)", "image": "./photos/2035936166056120691.jpg"}, {"caption": "Susan Smith Bachelor of Nursing (1975) & PhD Education (1995) “When I was 12, my father took our family to Pakistan and I saw acute poverty for the first time. I studied to become a nurse and then worked in Africa, northern Canada, and a very poor rural village in southern Mexico. After graduation, I volunteered with CUSO in Botswana and just felt like I was in the right place at the right time. I’ve never had a five-year plan - I just said ‘yes’ when an opportunity presented itself! Learning to be creative with very little, to be innovative, seeing how people living in poverty struggled to manage every day and yet many were so rich spiritually. That was eye-opening.\n\nThe family trip to Pakistan taught me about the unfairness of life, and I reacted to that, wanting to work on social justice. That entire experience was all about preparation. I look at my time in Pakistan and Africa as preparation for the work that I do now. International experiences have tremendous value but not as tours of poverty. If people really want to know the world, they have to get their hands dirty.” (1/2)", "image": "./photos/2035204685410097163.jpg"}, {"caption": "\"It was kind of an accident—not an accident, but it was unintentional. On a whim, I looked on the study abroad website and searched up ‘communication internship.’ I said, ‘why not?’ I applied, got accepted, and next thing I knew, I was leaving in two months for Tanzania to intern with a maternal newborn and child health initiative called ‘Mama na Mtoto.’ Part of my assignment was to work with local healthcare practitioners and community members and share their stories about accessing healthcare in rural areas. My biggest takeaway was the power of human potential and where compassion can bring us. I think a lot of times development is hindered because of the images created and shown in media, the notions that generalize and simplify the complexity that’s actually involved and the potential of the people living in developing areas. But really, I worked with incredible and bright people, including many volunteers, that work hard to make their healthcare system work with what they have.”", "image": "./photos/2034497000201144124.jpg"}, {"caption": "“My work has taught me to never rest on your laurels. Change and growth are inevitable parts of the job because there is always the need to adapt. It’s difficult to relay that with such a large and ephemeral team, so how you respond will steer you through trying times.\n\nChange is going to be a part of anything you do: building character, learning lessons, and most importantly, gaining resiliency no matter what. It is in our nature to evolve. We can’t stay the same, but we have to be open to different possibilities. We have to acknowledge that change and difference will always be there, and framing how to respond to it can make life a bit better.” (2/2)", "image": "./photos/2030188236371192543.jpg"}, {"caption": "“I never envisioned working in this career. As a former biological sciences student, I saw myself going into nutritional science. I was an international student and did not have a lot of opportunities for work. But being part of the development industry led me to work with people from various backgrounds. I thought there was something positive about facilitating the process of improving scholarships, even though I had been excluded from them because of my student status.” (1/2)", "image": "./photos/2028721121302818563.jpg"}, {"caption": "“I’m basically spending all my savings to be here. In my first year, I had to take English courses to improve my English. Now I’m studying geomatics engineering, and I’m finding the school system here to be a lot harder than back home. As an international student, the courses are also really expensive. My whole family could use the fees of one course to pay for a month of living expenses. It can be difficult, but I don’t mind because I like Canada. My favourite thing is the safety, where I can walk home from work at 12AM and not fear for my life like I would in Mexico.\n\nMy motivation to work and succeed is because of my sisters and kids back in Mexico. I want to help them get clean water and education. The plan right now is to study something where I can help make a change, and eventually work with different organizations that can make lives easier for families like mine. It motivates me more than anything to wake up everyday to make a difference in the world.” (2/2)", "image": "./photos/2014968564323658881.jpg"}, {"caption": "“I come from a small town located south of Tabasco in Mexico. We used to play outside every night. The town was different compared to other parts of Mexico, it felt really pure and we could all be ourselves. Things began to change and now the town is filled with narcos that wage wars, kidnap, and steal. I have had several friends get kidnapped, and one was killed after a party we were both at. Initially, the narcos only targeted the rich, but eventually they began targeting everyone. I knew I had to leave.\n\nI decided to move to Mexico City at 17 to finish high school. Moving away from my home and family was really hard, especially because I’m so attached to my sisters and mother. What made my move easier was knowing how much they wanted me to succeed. While I had gotten away from the dangers of my hometown, living in Mexico City came with its own challenges. I learned I always had to watch my back or my stuff would get stolen. It wasn’t easy for me to hang out with friends because it took a long time to travel back and forth, and by midnight I was scared I’d get killed. I knew this feeling wasn’t going to go away on its own, and that I had to get away altogether. I began researching schools outside of Mexico, and that’s how I found the University of Calgary.” (1/ 2)", "image": "./photos/2014222892955853139.jpg"}, {"caption": "\"We thought that if we kept quiet it would get better. That if we didn't say anything the Chinese government would let up, but that hasn’t been the case.  We realized that whether we speak up or not, it's going to happen. I’ve realized I need to do as much as I can as an Uyghur on the outside. I've been part of rallies here in Calgary at the Chinese Consulate and City Hall. I also went to Washington DC, where there is actually a large Uyghur population, to talk about the Uyghur people and what is happening. People have even gone to Geneva to protest at the UN. We've realized that we can't stay silent, and raising awareness has been working – major news outlets, governments, and more are picking up on it, but we're a small population, maximum 20 million, and over 15 million - the majority, are still in eastern China. This is why I feel so responsible to do something - as individuals we can’t stop this, if we want to see change and bring awareness to the fact that this is happening we need to work together. When we work together we are able to use our collective voices to raise awareness and hopefully bring change – doing things like talking to governments around the world, as well as the UN, to spur action from people who can do something about this and get the attention of the Chinese government.\n\nWe started a hashtag trend for missing people, like my uncles - lots of people have put pictures of their loved ones up with these three hashtags to try and capitalize on what happened a few weeks ago. There was this famous Uyghur singer who was reported dead, and they released a video of him alive the next day – showing proof of life. This started a flood of people demanding proof of life for their own loved ones through social media.\n\nAs a community, we started a petition for the White House with over 100,000 signatures to do something about the situation in East Turkestan. They have yet to respond but it is a step in the right direction. We're trying to increase knowledge, if more people know about it then there's more pressure, and the less China can ignore it. Eventually something has to give.\" (3/3)", "image": "./photos/2007443883819343482.jpg"}, {"caption": "\"One instance stuck with me - I was with my uncles and we were hanging around a parking lot, just standing around in the shade on a hot day. Here, doing that would be no problem - no one would even think about it. We were just talking about what we wanted to do next and didn't realize at the time that we were next to a big government compound.  The side-door opened up and this soldier came out with a big gun and he was looking at us because apparently there's something suspicious about three men just hanging around. Here in Canada, it’s something you wouldn’t really think about, but there it's an indication of trouble. I realized that everything that people in this region of China do is watched so closely. In order to get a phone there, my uncle had to give the government his information, so everything I did was tracked back to him. I had to be really careful about everything I was doing - even things as simple as going on social media could come back to my uncle and have negative implications for him.\n\nTwo of my uncles have been taken and are in these camps right now. They're both…. Well nobody knows. They’ve shut down communication completely - we have no way to even know if they are dead or alive. About 6 or 7 months ago we got the only piece of information that we have gotten from my mom’s side of the family in months. It was a picture of them smiling, and nothing else. While they seem happy, there’s no way to know more than that. From the outside, contacting people on the inside is dangerous for the people inside because if the Chinese government finds out, there can be negative consequences for them, and it could cause a crackdown. The entire situation is a mess, and nobody knows what's going on\". (2/3)", "image": "./photos/2004036388912534610.jpg"}, {"caption": "\"I come from East Turkestan which is now a part of China. The Uyghurs are an ethnic group of around 20 million people, and in 1949 we went from being an independent state to a part of China.\n\nToday around 1 to 3 million Uyghurs are being held in detainment or work camps. They're held there and undergo re-education – they’re forced to denounce their religion and who they are. While there is little news coming out of these areas, there are reports of torture and deaths occurring in the camps. \nIn 2009, the Uyghurs began to realize the extent of the oppression happening. Riots broke out. When I went to visit my hometown in 2015, which was one of the last years it was even possible to visit, I remember seeing tanks all the way up and down the street, with soldiers everywhere. All of the highways were controlled. You couldn't drive 100km without being stopped, forced out of your car,  searched, and ID’d as a young male. The idea was that the government was trying to create a surveillance system that knows where everyone is at all times\". (1/3)", "image": "./photos/2003346363417789880.jpg"}, {"caption": "“It’s upsetting that our schedules are so packed, because it gives us barely any time to hang out. When we do see each other, it’s usually for a study date. We enjoy studying together even though we’re in different programs. I actually like her so much that when she was in Vancouver this winter break, I FaceTimed her for like 3 hours everyday.” “She’s absolutely crazy, but also a sweetheart, and I love that about her. She has an impulsive character and is happy ALL the time, whereas I’m super tired and always serious. That’s what makes us a great combo.”", "image": "./photos/2002692039620561666.jpg"}, {"caption": "\"I was in LA on vacation when my first single started blowing up on Spotify. I didn’t even know it at the time, but when I went back home to check the stats I saw a crazy amount of streams. \nI am a full time student and I just started writing my own music last year. The music community has allowed me to meet so many interesting people, and I noticed a lot of people are in it for many different reasons than I am. \nWe have a lot of homegrown talent in Calgary, but most of them want to leave as soon as they get big. I have a friend who got really big in Calgary, and moved straight to Toronto. People don’t feel a connection to their hometown. \nI can see Calgary has the potential for something big. When I perform at places like Koi and the spoken word club, I can see the community is taking off.\"", "image": "./photos/1994534821943457951.jpg"}, {"caption": "\"Deep down, I knew that I had to quit drugs. But I couldn’t do it on my own. I tried. I even tried switching from hard drugs to alcohol, then alcohol to soft drugs. But nothing worked, I always end up going back to drugs. That lifestyle was getting really scary. I was getting involved with people that didn’t really care about me. I’ve had friends who died because of their drug use. It’s so sad and tragic. And their families are devastated. I almost died too. One night, I was standing in the apartment I was being evicted from. I had nothing left: no electricity, no water, no money to pay rent… nothing. It was one of the lowest points of my life... and I was ready to end it all. It was 9 or 10 PM. I had everything ready to go.\n\nBut something stopped me from suicide that night. I had a feeling that’s hard to describe. It was almost a voice... or some energy: a force. Something told me to call my mom. I called her and said “I just wanted to hear your voice. Can I come home?” My mom said that we would talk about it in the morning. She had no idea that I was on the brink of suicide. I did everything I could to fall asleep that night.\n\nTo this day, I’m still not sure what stopped me from dying. It was a feeling that I’ve never felt before... except when I help people as a counsellor. Looking back, I know I am very privileged to have a family who supported me and urged me to undergo treatment. A lot of people I used to know have died because they didn't have a home and most importantly, family support. That is why I have the drive to give back now. To provide people with what I was privileged to have.\" (3/3)", "image": "./photos/1988888328725179656.jpg"}, {"caption": "\"My counsellor at the treatment center sat me down and told me his story. Our stories were identical. The struggle with isolation, alienation from peers, using drugs and finding acceptance. You can google “addictions” and you can watch videos on Youtube, but nothing compares to looking someone in the eye and knowing that they have gone through the same thing as you. In him, I saw a man who was just like me. But he came out on the other side as this incredible, compassionate guy. I wondered, how did he do it? I wanted to find out. I was at a low point in my life at the time but he put his hand on my shoulder and said, “it’s going to be okay”. That was very powerful for me. I’ve never felt such genuine compassion. He is one of my biggest inspirations in pursuing a career in social work and becoming an addictions counsellor. \nAs an addictions counsellor, a big part is fighting against the stigma. The stigma that doing drugs is a choice, and that addicts lack willpower and deserve their suffering. People need to understand what’s beneath all of that. Why is someone using drugs? What are they getting out of it?\" (2/3)", "image": "./photos/1988152100119676638.jpg"}, {"caption": "\"At first, I only did drugs once in a while. Then once a week. Then all the time. The high was powerful. It was a way of coping with bullying that I experienced starting from junior high. I felt taller, smarter, and sexier. Drugs gave me the confidence I never had. I finally found people I could talk to. With those people, my body and appearance didn’t matter. They accepted me based on my ability to do drugs. I finally felt included. I felt connected. At the time, members of my family were struggling with substance addiction and mental health, and it was an unhealthy environment. When I had no one to turn to, I turned to drugs and alcohol. From then on, it was a downward spiral of addiction. \nWhenever my guidance counsellors talked to me in school, I would tell them about my family’s issues to avoid talking about my own problems and to justify my drug and alcohol use. I didn’t tell them about my own addiction. I thought the heat was off of me, and that I could keep doing what I was doing. It got so bad that after 5 years of high school I only had 33 credits. Eventually, I dropped out of high school. \nFour years after dropping out of high school, I found myself in a drug treatment centre. It was there that I told another counsellor the story I told everyone - the story about my family’s struggles with addiction and mental health. The counsellor looked right into my eyes and said “we’re not talking about your family. We’re talking about you. How are you doing?” I could no longer hide. And that’s when my life began to change. And it’s what brought me here today, as a student at the University of Calgary.\" (1/3)", "image": "./photos/1987505352854669694.jpg"}, {"caption": "“There’s so much stigma around it, but I’ve always known that I’ve wanted to work with people with special needs and the Community Rehab and Disability Studies program is what drew me to UofC. Growing up, my friend’s older sister was a person with a disability, and I really got along with her. A lot of people feel awkward around people with special needs, but I’ve never felt that awkwardness at all. I think being understanding and helpful towards their condition is important, and I make sure to treat them like my equals. I think this is what makes me a perfect fit for this field. \nI was very fortunate, growing up with a supportive family, and it saddens me to know that not everyone gets to have that life. Everyone needs someone who won’t give up on them. I believe I can do my part by becoming a foster parent myself someday.”", "image": "./photos/1980146963568861404.jpg"}, {"caption": "\"I have a very distinct memory of this huge crush I had on a girl in middle school. We went to the same summer camp. At the end of camp, we went to this mini golf and go kart place, and I won a ninja sword which was the coolest thing ever. I gave it to her, and she was really happy. Then, I demolished her in go kart.\"", "image": "./photos/1979421826708140135.jpg"}, {"caption": "“What thoughts come to mind when you hear the words “first love”?” “This is the second thing I thought of: when I started high school, I felt more wanted and appreciated by people than I did in junior high.”", "image": "./photos/1978801233797232022.jpg"}, {"caption": "\"While I was in elementary school, I had a crush on this really cute guy the entire time. In grade one, I gave him a letter I wrote about this rare Pokémon card I had, and that’s what we talked about. He’s a year older than me, so I don’t know where he went after junior high.\"", "image": "./photos/1977971885083021003.jpg"}, {"caption": "\"As students, there’s usually a lot of things we have to juggle at the same time. Aside from the five courses you’re taking, you often have extracurriculars. If you throw in a part-time job on top of that, it’s easy to get overwhelmed.  When I get stressed, I think of my mom. Between raising three kids and working full time, she still trains and runs triathlons. I think the only time she stays still is when she sleeps. Otherwise, she’s always doing something. Before, I used to question whether fitting that many things into my schedule was a good idea, but if my mom can do it then why can’t I? I’ve been asked how I balance a lot of activities, but I think if something is important to you and you want to do it, you’ll always make time for it.\"", "image": "./photos/1975111033556332774.jpg"}, {"caption": "\"When I first came to university, I was worried about losing my passion for art. I thought art was just something I did on the side, just a hobby. I thought that it was impractical, that it had no professional value. But around my second or third year, somebody recommended art therapy to me, and that’s what I’m currently pursuing.\n\nI want to combine art with psychotherapy to help people cope and work through their trauma. Art is a powerful mechanism for coping and healing.  This past summer, I taught art at a summer camp and got the opportunity to work with teens on the autism spectrum. It was not only very rewarding, but also reminded me of the reason I want to go into this field. It’s amazing to work with people and see them find their unique voice and style within art. I’ve always loved sharing art with people, and I’m glad that I’ve found a way to pursue it professionally.\"", "image": "./photos/1974355839541518621.jpg"}, {"caption": "“I took last semester off. I think there’s a lot of pressure for students to get through school and not take any breaks. Luckily, I had some very supportive people in my life who encouraged me to take care of my health first. In the grand scheme of things, a semester is not much. I’m glad I took that break because now I’m balancing work, school, and my social life a lot better.\n\nTo people struggling with mental health, I’d encourage them to reach out for help. And if reaching out doesn’t work the first time, don’t be afraid to try somewhere else. Not everybody will respond the same way. Unfortunately, you may need to try a few times, but it’s worth it to find those one or two people who support you and understand you, even if they can’t be your therapist, even if they can’t fix your problems. Sometimes, just having friends who acknowledge your struggle goes a long way.”", "image": "./photos/1973690598759422719.jpg"}, {"caption": "“I’m not a competitive person, but I like to challenge myself. I want to be learning new things and working hard until the day I die. Improving myself and striving for the next level has always been my goal, but sometimes I wonder if this mindset is unhealthy. I don’t know if I will ever be satisfied with what I have. If I didn’t have this drive to constantly become better, would I be happier doing something easier? If I had to choose though, I would much rather be the poorest man in a rich neighbourhood instead of the richest man in a poor one.”", "image": "./photos/1973624897990318246.jpg"}, {"caption": "“It all started with music. Ever since I was little I’ve been listening to something, and so I got involved with dance. I’ve tried out all different styles – ballet, hip-hop, classical – but since I’m Indian, I’ve always had this connection to Bollywood dance. It’s just a very unique style. There’s certain techniques, precise formations, and behind every performance is a unique story. When I am performing, I want to tell that story. Sometimes a performance doesn’t go well though. One time I got so discouraged that I didn’t want to dance again, but I realized that I shouldn’t let a single performance define my abilities. Now I dance with this all-female, non-profit group, Madhuban Performing Arts, that performs all around the city. The greatest feeling is right after a performance when we know we did well and that all our practice and hard work has paid off. Everyone in the group has different opinions, but we all respect and support each other. We are all about empowerment. Being together helps me refocus my energy and it raises my confidence. We do dance solely because we love it.”", "image": "./photos/1973025496699846094.jpg"}, {"caption": "“I’m a research assistant for a local filmmaker. We’re doing a project focusing on the AIDS crisis in Canada. The cause is very close to my heart. My parents knew people who died of AIDS- people they knew and worked with. During the ‘80s, there was a lack of response to the crisis due to homophobic sentiment and a general ignorance about what people with AIDS go through. People still carry misconceptions and judgments today, even though medicine has been able to improve the prognosis for people with the disease.\n\nI believe that art has the ability to educate and to give people a voice. It has the ability to humanize and evoke compassion. Art tells us so much about history and about how people think during a given time. However, so many works of art were stolen. It happened during World War II by the Nazis. It happened in North America during European colonialism. So many artifacts were taken from Indigenous communities. Many of the pieces we see in museums today were stolen and I hope we can help return artifacts to their rightful owners. Art restitution law addresses this problem, and I’m thinking of pursuing it in the future.”", "image": "./photos/1970201201737148006.jpg"}, {"caption": "“I grew up in India in a very well off community. A day that has always stood out to me was when I was around five years old and was returning from a shopping trip with my mom. We were sitting in a car with curtains covering the windows. We stopped somewhere and suddenly children swarmed our car begging for money. I couldn’t stop looking at the tear stains on their cheeks. I looked at their tattered clothes and then down at my own expensive clothing. I remember bursting into tears thinking about how different our lives were. Wanting to help, my mom and I gave them food. It’s become a moment that has really defined me. It’s made me aware of my privilege and the struggles people face all over the world. It made me realize now that I just want to be able to make a difference for people facing poverty.” (2/2)", "image": "./photos/1969445828096751834.jpg"}, {"caption": "“I experienced bullying while growing up. It was quite traumatic and I was so scared to talk about it. I internalized a lot of it and it took an emotional toll on me. It led to a lot of social anxiety where my automatic reaction to people was to not trust them. I remember getting restless and breathing rapidly many times. I couldn’t understand why I felt the way I felt. \nI eventually ended up seeing a therapist for a while and it really helped me. She made me understand what anxiety really is all about, and also worked with me to come up with coping mechanisms and reframe the way that I saw things. It also allowed me to open up and talk to the people I love. My family has been very supportive and has made the effort to understand how I function. Over time I’ve come to realize that there’s nothing wrong about having any kind of anxiety. It’s just a part of me that I’ve learned to embrace. It’s very normal. It’s also taught me how important it is to be compassionate towards other people’s needs.” (1/2)\n\nKeep the conversation going, share Shreya's story with #BellLetsTalk and tag us.", "image": "./photos/1968476973182550678.jpg"}, {"caption": "“My best friend in middle school was verbally and emotionally abused by her father. For her, it was terribly difficult growing up. I remember wanting to help her but I didn’t know how, I was only 12. Many people who survive domestic abuse feel like they can never talk about it to anyone, even after escaping it for many years. \nI think many factors have caused domestic abuse to be more prevalent in our society these days. We’re in a time of cultural shift. There is a shift away from traditional gender roles, and a move towards household and gender equality. This may threaten some abusers, as taking away masculinity often results in domestic abuse. This is not to say that men are not victims of domestic abuse. This issue most often affects women, but men should not be left out of the conversation.  I wanted to make domestic abuse less of a taboo subject, empower the people in these situations and take the power away from the abusers.”", "image": "./photos/1967920227938653174.jpg"}, {"caption": "“My life right now mostly consists of research and rock climbing. I love rock climbing. It’s really physically demanding and technically challenging. To me, rock climbing is both a physical sport and a mental puzzle because you need a lot of strength but you also need to problem solve quickly. At home, I keep a journal to plan and visualize the routes and steps I need to take to be more efficient. In some ways climbing is a lot like research; it's really hard to be successful on the first try so you have to be willing to take things one step at a time and build upon small accomplishments.”", "image": "./photos/1967910438231741670.jpg"}, {"caption": "Maureen Mcleod B. Ed. 1966 \"I quit my teaching job in ’79. My late husband and I took our two daughters out of school. We sold our house and cars and traveled in a second hand motorhome for 10 months through North America. After the trip, we returned to Calgary where I worked as an executive assistant for the Chairman of the Board to a big company in Calgary. But eventually, I knew I was going to lose my job because of my boss’s retirement. Close to that time, I visited my sister one afternoon for tea. As one of her friends walked out of the door she said “Come to Japan!” And by October we were there. My husband and I got English teaching jobs and before we knew it, five years flew by. Close to that time, the internet began to surface. I remember thinking that I would never figure out how to use it but thankfully, I was a fast learner. I met a woman on the internet who talked about a teaching opportunity in China. We taught at an international school in the Tianjin area for another three and a half years. After that adventure, we returned to Calgary. We thought we were ready to settle down, but we couldn’t forget how much we liked visiting Hong Kong. So, when a posting came up for Macau (near Hong Kong), we couldn’t turn it down and spent another three years abroad. Back when I was about to lose my executive assistant job, I thought it was the worst thing ever. But after Japan, Guangzhou, Tianjin, and Macau, I realized it was the best thing that had happened to me.\" (2/2)", "image": "./photos/1967688966054149741.jpg"}, {"caption": "Maureen Mcleod B. Ed. 1966 \"I graduated in 1966 from the University of Alberta at Calgary as part of the last class before it became the University of Calgary. When I began in 1962, there were only three buildings. At the time, the Government of Alberta needed teachers so badly that they paid for a portion of your tuition if you were in Education. I chose to study education because it was the thing to do. It just seemed like a good plan.\n\nAs frosh, one of my girlfriends and I wanted to join the University newspaper. We had come from a small high school and thought the Gauntlet was just the place to be. We applied to be part of the paper, and to our surprise, we were accepted! My responsibility grew over the years until I became the Editor in Chief my final year. I actually met my husband through the Gauntlet. He came to work for us and I was his boss!\" (1/2)", "image": "./photos/1967687919147509095.jpg"}, {"caption": "\"I wouldn’t be where I am now without Dr. Addy. I actually met her back in my first year. I walked into her office, thinking it was Advising, and started peppering her with questions about Science and how my degree worked. She answered all of them, which was great, but as I walked out the door, I said “Hey, can I get your card? You were really helpful.” I looked at the card as I was leaving and I realized she’s the Associate Head of BioSci. In my head I was like ‘Oh my god! She’s the department head and this random first year just walked into her office to ask her a bunch of questions.’ Her office is in EEEL, just like Advising, but I had gone to the wrong floor... and the wrong room. \nThe funny thing is that last year I worked with her a lot as a Science Rep, and although it had been a few years, she remembered that first meeting. I’ve sat on committees with her, and I’ve also done projects with her. I even did my ‘teaching and learning’ based research course with her. I’m really glad that I could spend my last year in Science with a prof that I’d known for a while. She’s just an amazing individual, and she’s definitely contributed to who I am today in a significant way. When I was on the selection committee for the Teaching Excellence Awards, I had the amazing opportunity of presenting Dr. Addy with her award. That was a very special moment for me this year.\" (2/2)", "image": "./photos/1967344906239682898.jpg"}, {"caption": "\"It’s always hard to push your boundaries. Running a campaign for the SU election wasn't easy. I’m actually pretty introverted, and I never thought I’d run in an election. I never thought I’d be in a role that’s outward facing. Looking back, these situations were just examples of when I had to push boundaries. I’d ask myself sometimes 'Am I the best person for this?' - Probably not. But I’ll still give it a try. Those were just doubts that I had to overcome.\n\nRunning for Science Rep changed my perspective, and it was a big motivator for me. I try to do something that’s different every year, so last year I volunteered and did all this cool stuff with the SU. I got to see a whole bunch of the great work done by the people before me and it really inspired me. In my first year I thought the SU didn’t really do anything. Like most people, I thought they just won if they were popular. But that’s not entirely true. There’s a legacy here. The SU is a bunch of really great people doing amazing things. I wanted to be a part of it, to have a positive impact on campus and in my faculty. Now, I just want to leave the campus in better shape than it was 5 years ago.\" (1/2)", "image": "./photos/1967344398166697944.jpg"}, {"caption": "“A large part of me is a combination of everyone that I meet. When I first moved to Canada, I was scared. It was the first time I lived away from my dad. I remember worrying about making new friends, and I had huge misconceptions about what a public high school would be like because I had gone to a tiny private school for my whole life. I thought I wasn't going to meet anybody. I’m a social person, but over time, I learned how to be by myself.\"", "image": "./photos/1963579665721400957.jpg"}, {"caption": "“When I was younger, my family moved back to India to reconnect with our family with the intention of staying there. India is different from Canada in the sense that there are so many cultural differences and health concerns. Through my experiences, I was able to compare the two places that had a huge impact on how I see the world today.\n\nIn grade 2 or 3, my health really suffered. I had anemia, asthma and I lost a lot of weight. This made us see the value of living in Canada. Benefits like free health care are hard to ignore. I think that my time in India is a big reason advocacy has  been such a big part of my life. Seeing the impact advocacy can have on people’s lives has led me to where I am today.”", "image": "./photos/1962726434833241714.jpg"}, {"caption": "“I was the SU Faculty of Nursing Representative for two years before deciding to run for Vice President Academic. It’s hard to describe what Election Night felt like, but when the Chief Returning Officers announced my name, it was one of the best moments of my life. My partner and my best friend were both there supporting me (literally) when my name was called. My dad and my sister were also in the crowd, and I think my dad was more nervous than I was! I don’t think anything can come close to having the most important people in my life there to celebrate with me. The best advice that I can give anyone is to surround yourself with people that make you want to be better and do better.” (2/2)", "image": "./photos/1962036294574041485.jpg"}, {"caption": "“In my first year, I had a plan – I knew exactly when I wanted to graduate, what I wanted to do with my degree, and I didn’t let myself consider taking part in anything that wouldn’t get me to my end goal. After finishing my second year, all of that changed. I started taking part in extracurriculars I was passionate about and decided that I didn’t want to be defined by my career “plan”. I wanted to be defined by my passions. \nOne of my passions is art. In high school, painting was a major stress reliever. I would work on art pieces for days and was so absorbed by my artwork that my dad had to intervene! The painting here is a legacy piece for the SU Office. There used to be a tree on the wall that VP Academics would add pieces to when they finished their terms. The tree was taken down one year, so I decided to start a new one. I started painting this on my first day here – it’s not finished, but I work on it between meetings.” (1/2)", "image": "./photos/1959766234438367131.jpg"}, {"caption": "“When I was starting university, I knew that I wanted to work with people. I chose Bio-mechanics in the faculty of Kinesiology because it pulls from multiple fields, and I liked the human aspect. I thought I would be out in four years, maybe go into med school after. But I was wrong, I will be taking a fifth year. Things don’t always go how you think they will. I feel very lucky to be in the position I’m in. When you’re writing out your life plan, make sure you’re writing in pencil and that you write with double spaces. This way, you can get rid of what doesn’t fit anymore, and you have space to add what inspires you.”(2/2)", "image": "./photos/1958546795656501040.jpg"}, {"caption": "“Empathy is so important. As President of the Students’ Union, I try to advocate for the entire population, including the underrepresented groups within that population. To acknowledge your own privilege requires self-awareness. When you’re advocating for something, you have to ask yourself, ‘are the services that I’m using accessible to everyone else?’ Often, barriers are invisible to others. Currently, I’m advocating for gender-inclusive change rooms in Kinesiology. It doesn’t affect me but it affects transgender people on campus every day. These students pay fees to be members of Active Living, but can’t use the services that other students get. I hope to break down this barrier for them.” (1/2)", "image": "./photos/1957532550964667633.jpg"}, {"caption": "\"In 2015, I went on a group study to Belize to study howler monkeys. It wasn’t a comfortable place to be. I had sand flea scars for years afterwards. Still, I remember being in the field, observing the monkeys, and thinking how cool it was that I was doing this. I remember being grateful.\"", "image": "./photos/1955319440249789540.jpg"}, {"caption": "“I used to be scared of telling people that I’m hearing impaired. I didn’t want to wear my hearing aids because it made me feel like I was different. And I didn't want to be different. It was scary to think that I will someday go deaf because I love music and talking so much. But as I got older, I didn’t have a choice but to wear them. \nMy mentality changed in Grade 11 when I spoke to my vice principal about my hearing aids. He told me that his friend, who was closer to my age, is going through the same thing but still lives life happily and comfortably regardless. From then on, I decided not to let it control me anymore. Being in Calgary has really helped, thanks to the community of hearing impaired people. I've also been given the opportunity to learn ASL and qualify for an interpreter. I guess looking back, my advice to my past self is that it doesn’t matter that you’re different, you have to live life to your fullest. Every step is just a new adventure.”", "image": "./photos/1932481788224030808.jpg"}, {"caption": "“I’m struggling with living in the moment. A lot of the time, I think “when I graduate and get a job, then my life will be better.” Why can’t life be good right now?”", "image": "./photos/1931587933211688016.jpg"}, {"caption": "“Being an immigrant and first generation means I’ve been the first in my family to do a lot things: the first to live alone, the first to attend a Canadian post-secondary institution, and the first to define success for my family. Sometimes it’s difficult to feel a sense of belonging, especially when you get lost in others’ vision and expectations for you. It’s hard to identify and pursue my interests while straddling two different world-views.\nI think it's important that other people who don’t have the same support system at home aren’t left behind and still have the opportunity to excel in university. I founded a non-profit that helps provide resources to students who will be the first in their family to attend a post-secondary institution in Canada. I want to be able to take luck and privilege out of the equation. Reaching out to students early on, telling them that they matter, that they have potential, that they can excel, and providing them with the resources they need is so vital in helping them reach their fullest potential.\nIt took me awhile to figure out who I am, where I wanted to go in life, and what I am capable of. I want more people to have the support system and the guidance that I and so many others didn’t have.”", "image": "./photos/1928595815799168778.jpg"}, {"caption": "“When I was choosing my major I was really torn between business and engineering. From childhood to high school, I’ve always leaned towards business, but I chose engineering because I felt it would provide the tools to change the world through innovation.\n\nLast year, I got to participate in the Schulich Engineering Competition with a few friends. We had to solve a problem by developing a prototype in a given amount of time. We also had to factor in things like cost, functionality, efficiency, and testing time. My favourite part of the competition is being able to apply the skills we learned in class to real-world scenarios. It really mimics the workplace because everything is constantly changing and you have to learn to adapt and think outside the box. It made me realize that engineering has a lot more in common with business than I thought. Both need cost analysis and an understanding of the strategic impact of their projects.\n\nJust like businesses, engineers need to know how to work well in teams and communicate effectively. There is a misconception that they work alone, but they need to trust their teammates since everyone has their own strengths. I feel very fortunate that my team was chosen to move on to the Western Engineering Competition. Although we fell short of nationals we’re ready to make a come back this year!”", "image": "./photos/1923676140342346941.jpg"}, {"caption": "\"Last year, some friends and I developed a program to get high school students involved in research. We built it from the ground up and faced a lot of logistical hurdles, but in the end, we pulled it off. Each of the students came up with a great bioinformatics project. We had a symposium at year’s end and it went well. Some projects even got published in a student research journal.\n\nI’ve really enjoyed my experience in research so far and wanted to pass down my passion to future university students. I want students to gain an understanding of what real research is like; to learn firsthand how frustrating yet rewarding research can be. You spend so much time troubleshooting and working towards a final product that you aren’t sure will ever be realized – but when everything goes right, it’s the most wonderful feeling.\"", "image": "./photos/1922205772020793059.jpg"}, {"caption": "“I love to travel. Earlier this year, I had the opportunity to visit Japan. I was there for two weeks with my little brother. It was a mind-blowing experience. Most people would enjoy the fast-paced city aspect of Tokyo, but I really loved Kyoto, which is this old city with a lot of nature and history. It was so quiet and I loved seeing the beauty of the old gates and temples. What shocked me the most was how polite everyone was. I thought Canadians were polite but people in Japan are on another level. It made the experience so much more worthwhile and special.”", "image": "./photos/1919299811308249227.jpg"}, {"caption": "“I decided to leave Iran because I felt like all my values as a woman were constantly challenged, questioned, and ignored. In such a religious country, I felt pressured to live a double life, one for the government and one for myself. It became almost paradoxical. This pressure made it so that people, including myself, are left with no choice but to leave. It’s so difficult to care so much for your country but not have the resources to change anything.\n\nWhen I was 18, I moved to Canada to study at the University of Calgary. I researched countries all over the world and chose Canada for its human rights record, LGBTQ+ rights, as well as its education system. My goal coming here, is to go back to Iran one day with the resources to make a change, particularly in the lives of women. I'm still trying to figure out how to do that but, I hope I can inspire others to do the same.”", "image": "./photos/1918592968751666524.jpg"}, {"caption": "“When I started university, I had the goal of becoming a speech pathologist but, after being in the program for a year, I realized that it wasn’t the right path for me. I ended up switching into the Communication Studies program because I was interested in the topics, and I did really well in my communications class. I also found it to be something that could open up a lot of career options for me.\nI don’t regret switching programs because I get to do something that I love every day. After I graduate, I hope to move to Copenhagen and get into the design field. My dream is to work for a magazine, doing layouts and communications because I love creating things that appeal to people and draws them in.”", "image": "./photos/1917915061951759704.jpg"}, {"caption": "“If I could say a few things to my first year self, I think I would say: figure out your learning style because it's easy to get stressed when you don't know how to study. Search for strategies to cope with the material thrown at you and really immerse yourself in the knowledge. And even then, it’s OKAY if things don’t go as planned. It’s OKAY to do poorly on a few exams. Sometimes you will mess up on a few project and assignments, but you can’t let a few mistakes hold you down. Perseverance. That’s one of the most important things I learned at the U of C. If you dwell on the past, you won’t go further.”", "image": "./photos/1916482585819699477.jpg"}, {"caption": "\"When you’re at the bottom of a really competitive faculty, it can make you feel like you have to drop out. Last year, I overcame that feeling. I told myself “I’m going to ignore all the things saying I should give up.” Having friends here also helped. If I had been anywhere other than U of C, where I know people, it would have been a lot harder.\"", "image": "./photos/1912690673446943063.jpg"}, {"caption": "“I recently went back to playing hockey. I played a lot when I was younger. From Grade 5 to 12, I was always doing something on the ice or something related to hockey. I just got some new equipment and there’s a lake that freezes over near where I live. I would just skate around in circles, and I realized how much I missed playing after such a long time. Skating again brought me back to simpler times. Last year was pretty rough for me, so getting back on the ice was simple, yet very satisfying. It didn’t look like much, but it meant a lot to me. I was at peace, reliving the past and being so happy.\n\nI had a knee injury in the past, which delayed me from playing sooner than I wanted. But the long wait made getting back completely worth it. I really hadn’t done anything related to hockey ever since graduating high school, so doing something I loved when I was growing up just freed my mind. After all those years not playing, I felt happier than ever before.”", "image": "./photos/1911995055485308069.jpg"}, {"caption": "\"I just enjoy spending time with her. I feel like that’s what a relationship should be. It’s not about liking how they look or how smart they are. It’s about wanting to spend time with them.\"", "image": "./photos/1911327445953425428.jpg"}, {"caption": "“My parents immigrated to Canada from Poland. This has had a huge impact on my life. Being raised here has exposed me to diverse people and great opportunities, which is the reason my parents moved in the first place. They tend to be a little strict because of this. There’s more pressure on me. It’s a lot, but I think it’s good.”", "image": "./photos/1910570630160384609.jpg"}, {"caption": "\"There was this time when I was visiting family in Egypt, and my cousin, brother, and I rented motorcycles from this shady place. We were on a dead end road which ended with a metal fence, and I was going pretty fast. The accelerator got stuck and the brakes stopped working, so I jumped off. It was scary at the time, but it’s just funny looking back at it now.\"", "image": "./photos/1909910633659347955.jpg"}, {"caption": "\"Over the summer, I worked with a program for kids whose behaviours put them at risk of involvement with the criminal justice system. There was this one girl in the group who stood out to me because she was particularly quiet and reclusive. I spent a lot of time getting to know her and trying to encourage her to come out of her shell. At first, this seemed pretty challenging. But it helped that I was a quiet kid too so I understood that speaking up takes both courage and time. I guess that’s why the highlight of my summer was when she opened up, even if it was just a bit. I was really proud of her, and she made me realize how much working with kids has enriched my life. Although it can seem difficult to figure out how you can best help a kid, at the end of the day, every kid has the potential to become fantastic and deserves a solid chance at life. I felt privileged to be in a position to cultivate that potential.\"", "image": "./photos/1909140156070446800.jpg"}, {"caption": "\"I have always wondered if it was possible for someone living millions of years ago to have the same genomic information as someone living today. This was the kind of question that made me want to pursue research in genomics. I came to Calgary just this August. Before that, I completed an undergraduate degree in computer science in Bangladesh where I learned about Natural Language Processing through machine learning. \nIn linguistics, a random arrangement of letters can create words that have meaning. Similarly, the four letters in our DNA can construct a complex organism that has walked the Earth for ages. This connection was the bridge that led me from one field to another. \nI am excited to be able to get in the lab soon. Hopefully, in the future, I would be able to apply my knowledge in genomics and computer science to aid in understanding rare genetic diseases. I want to help physicians get the tools that they need to cure patients around the world.\"", "image": "./photos/1908389258918491267.jpg"}, {"caption": "“I’ve known I wanted to work with kids since I was in high school. In grade twelve, we had the opportunity to go back to our grade one class. Seeing my grade one role models helped me decide on what I am doing now - teaching. One of my favourite things about my career path is the way we make an impact on our students.\n\nI want to be remembered as someone who is always kind and open, someone who is always smiling and there for you. There’s no harm in being there and helping someone.”", "image": "./photos/1907566938389801356.jpg"}, {"caption": "\"I used to try to be involved in a lot of things, which meant sacrificing my own well-being at times. Now, I’m able to balance what I’m doing and look after myself more.\"", "image": "./photos/1906853025268378414.jpg"}, {"caption": "“I made three pies over Thanksgiving. I’m the youngest of six kids from a huge family, and both of my grandmas passed on their love for cooking. My baba was part of a curling league. She’d bring a crock pot to the curling rink and, in between being on the ice, she would cook for her team. My oma would do all the Christmas baking, and everyone would go home with a huge container of pies, tarts, and homemade O’Henry bars. She would always say, ‘If you go home hungry, it’s your own damn fault.’ Unfortunately, my oma passed away just as I was getting into baking, but I have a lot of her recipes. She used to make lemon squares for Christmas. When I make them now, I feel like it keeps the memories alive.”", "image": "./photos/1906143116499391153.jpg"}, {"caption": "\"I was very shy in junior high. Going into high school, I wanted a fresh start: I hoped that I wouldn’t be seen as the shy kid. I never actually knew what I wanted be known as. I just wanted to be involved in more activities and have friends that I could relate to, so I went to a high school where I knew nobody, and nobody knew me. It was one of the most important decisions I ever made as a young person.\"", "image": "./photos/1903281934251965675.jpg"}, {"caption": "\"Breaking my leg was a huge struggle. I was wheeled around for a month, graduated on crutches, and spent my last free summer and start of university still on crutches. You have to rely on other people, and you’re less independent overall. I think a good thing that came from it was that I got a feeling for what it’s like having less mobility.\"", "image": "./photos/1902461423515249584.jpg"}, {"caption": "“We love travelling, and it just so happens that my friend works in WestJet. He got us buddy passes, so last year we backpacked to Thailand for two weeks. We spent our time bathing, feeding native elephants, discovering small islands, beaches and night markets on the Krabi province. One day, we took a speedboat to go to four different islands and our boat ran out of fuel in the middle of the ocean. We were frightened at first, but then we sat at the tip of the boat and started taking selfies!”", "image": "./photos/1901736913838860796.jpg"}, {"caption": "\"I’ve continued to struggle with figuring out what makes me happy, because it’s easy to say I’m having fun in the moment, but I haven’t found something to ground and connect myself to yet.\"", "image": "./photos/1901010587272221588.jpg"}, {"caption": "Matt Bootle, B. Comm in Accounting (1982) “I’m at EY for the people and the values - everybody here is focused on doing the right thing. I especially appreciate the younger people here – I draw energy from their combination of talent and vigour.  Also, this place has a sense humour to it - we’re able to laugh at ourselves and with each other. That’s why I’m here at EY: the values, the younger people, and the ability to get serious work done without taking ourselves too seriously.” (2/2)", "image": "./photos/1899443231039417000.jpg"}, {"caption": "Matt Bootle, B.Comm in Accounting (1982) “Ever since I was a kid, I always wanted to be an accountant. My Dad was a controller of a small saw mill company. On the odd Saturday he would take me along with him, just so Mom could have a break. He would sit me down in front of these great-big adding machines in the bullpen at his office. They were like dinosaurs. He would give me a brand new roll of tape, and say “You go and do whatever you want with that machine. And when the roll is done, you’re done. Have fun!” And that was it, I was sold. He was an accountant. Whatever he was doing, I wanted to do it too.” (1/2)", "image": "./photos/1897446517351280273.jpg"}, {"caption": "“My grandmother had trouble walking. I used to hold her hand and walk with her. But my dad told me to ‘let her do as much as she can on her own, to give her the same sense of independence she used to have’. So, when she would walk to her bedroom, I’d pretend not to notice her. I’d always keep an eye on her though. \nOnce she was having trouble getting into bed because her legs had weakened so much. I picked her up and sat her on the bed. She looked at me and started crying. I teared up too. She said ‘you’re a young boy, why are you doing this for me?” I told her ‘you’re my grandmother. I’m giving you the respect you deserve.'\" (2/2)", "image": "./photos/1875066993221447720.jpg"}, {"caption": "“My mom was diagnosed with rheumatoid arthritis- the same sickness that my grandmother passed away with. I freaked out. My mom is my best friend. We have a very open relationship, and I tell her everything. If I have something on my mind or I need to rant, she’s the one I go to. Her sickness made me realize that I needed to be more responsible- I couldn’t be a care-free kid anymore. My mom has always been there for all of us. Now I need to be there for her and my family. I have two younger brothers. I don’t hold their hands and walk them through life, but I’m always there for them. If they do anything stupid, they tell me about it. I do what I can to help.” (1/2)", "image": "./photos/1874299736211914829.jpg"}, {"caption": "“My brother is a physician and my sister-in-law is a surgeon. They both work in Syria under extremely difficult circumstances. In besieged areas, health care workers aren’t allowed to deliver healthcare, or even food. If they’re caught aiding civilians, they’re accused of working for the other side. They suffer serious consequences just for doing their jobs. People are killed, maimed and imprisoned. Healthcare in Syria has become an instrument of war on both sides.\n\nThe health care workers do the best they can. It’s not a matter of political alliances, it’s a matter of helping fellow human beings. They’re working under extreme circumstances with very little resources. 70% of resources, hospitals, and clinics are destroyed beyond repair. Many of them deliver aid from underground caves that they use as makeshift hospitals. Nobody can hear their cries for help. They’re on their own.\n\nThe least we can do is say that there’s a community in Canada that cares. If they know we’re thinking of them, perhaps they won’t feel so alone.”", "image": "./photos/1766525775596767465.jpg"}, {"caption": "\"Because of the bombings, many hospitals in different Syrian provinces have been destroyed. People often move to a private healthcare practice because of the long waitlists in the public sector. But private healthcare is very expensive, even for the wealthy. Both systems are doing as much as they can to get help, but many Syrians still can’t afford the required medication and services. A lot of local organizations have been trying to help but it’s a slow process. Everyone is trying, but there are still so many people that need help.\" \"What are things students like us can do to help fight this healthcare issue in Syria?\" \"I think Canadians can aid Syrians financially to help supply medication and surgery equipment. But even more than that, the world needs to see that we’re much more than how we’re portrayed in the media. The beauty of Syria is constantly being overshadowed by images of war. But our country is so much more than that. It’s filled with beautiful places, culture, and with the beautiful spirits of Syrian people. This is the side of Syria that I want the world to see, explore, and to realize that we as a nation are full of hope and just want to lead a normal life… Every night we hope to sleep peacefully, every morning we wake up hoping to get our country back - to live another day, walk down the roads without fear, eat good food and enjoy the evenings with our families. We just want to lead normal lives.\" (3/3)", "image": "./photos/1765685922063834802.jpg"}, {"caption": "“When I was about to leave Syria, my friends invited me just to ‘hangout’. I arrived late and saw that they had bought a cake and presents! I immediately thought “Is it someone’s birthday? Did I really forget that?”. I got really mad at them because I thought I wasn’t dressed well enough for the occasion and didn’t bring a present myself. But then I found out it was actually a surprise party for me! I really miss my friends and family.\n\nWhen I first landed in Canada, all I saw was snow - no greenery anywhere! Everything was new for me in this country; the roads, the people, and the places. But my goal in life is to not be afraid anymore, and so far, living in this beautiful country is helping me achieve that. Canadians are very nice people. I see people here smile all the time and it makes me feel so warm and happy!” (2/3)", "image": "./photos/1764885620374598167.jpg"}, {"caption": "“One day I had an exam and there were four explosions. Going into Damascus they had blocked most of the roads, so the students on the bus had no choice but to get off and walk to the university. It wasn’t the safest walk and would take about an hour to get there. Luckily, we found a man with a car who was also going to the university to drop off his daughter, and so four other students and I all crammed into the back of his car. I remember he kept repeating, ‘Everything is going to be okay.’ as he drove us to our university. We all made it there in one piece and I thought to myself - God stood beside us that day.\n\nMost of my friends are still studying at the University of Damascus and I’m in touch with them every day. It’s so hard just to travel to the university. It’s also dangerous just trying to study there. Sometimes, they don’t have electricity and have to study with only the light from a candle. I can tell they’re tired of it all, but they still have hope. They’re just so motivated to graduate - it’s what’s keeping them going. Before I left for Canada, I had one last paper to hand in for class, and on my way there our bus was shot. When moving to a new country, you shouldn’t have to say “goodbye” to your home country like that. I’ve only been in Canada for two months and they’ve told me their situation has gotten worse. There have been more explosions. It’s war.” (1/3)", "image": "./photos/1764692271315103436.jpg"}, {"caption": "“Joining clubs can help you discover more of yourself as a person. I thought that being in a club like the UofC Fashion Network was a great way to be involved in university. Back in high school, I was more focused on academics, so when I got here, I wanted to branch out and see what else I could push myself to do. I was really trying to find the things that I could grow into, and I did. \nI’m more of an “ideas” person, and I get to put them into action with our club. I also get to share and receive many other ideas that are bouncing around. More importantly, this club has helped me realize that there’s always another way to approach an idea, which pushes me to do better.” (3/3)", "image": "./photos/1761995534354573186.jpg"}, {"caption": "\"It was actually by chance that I got involved with the UofC Fashion Network. I had a friend who was already a part of the club. At one point, they were putting up their posters around campus and I thought they might need help. At the time, they needed an executive that would handle marketing duties. I’m a marketing student, so the club and I just clicked. Being a member has been an eye-opening experience for me. Not only have I learned more about fashion, but the group has also helped me hone my skills as a marketing student.\" (2/3)", "image": "./photos/1761237916763103898.jpg"}, {"caption": "\"Fashion is something that people usually take for granted because it’s just there; it’s easy to dismiss the clothes we wear every day. What people don’t always see is the industry itself, especially the ethical side of it. I believe that talking about the ethics behind fashion is a great way to get more people to understand it. I have high hopes for Calgary when it comes to taking part in this issue. With the direction that this topic and issue is going, there will be many more voices that can speak for the individuals that strive to make the industry a more inclusive and respectful one.\" (1/3)", "image": "./photos/1760478945859808344.jpg"}, {"caption": "\"Death is a lot to that one person, and after that it’s done. The people who are left behind are the people you need to fight for. They carry the burden of grief. The person who has passed away doesn’t know what you’re experiencing. You are carrying the burden of their death and maybe you’re not mentally ill but mentally really really sick - I’ve had the most outlandish thoughts. I was never religious before but you search for answers and you look outside of yourself for everything. \nThe biggest mistake people make when they talk to someone who is grieving is that they say they understand. You think you understand, but you don’t understand. Everyone grieves so differently, even within my family. If someone else lost their brother, I wouldn’t say I understand what they’re going through. I can try my best to understand and relate but I wouldn’t understand. I’ve lost two grandmothers, a dog, and you think those things are hard and sad at the time, and then you lose your 22 year old brother and it’s so different. It’s unlike anything I’ve ever experienced. You don’t understand and I’m so glad you don’t understand. I hope you never have to understand. It’s unbelievably sad and hard and isolating and lonely.\n\nAt the same time, grief isn’t something you can compare. Sometimes, you meet someone and they change you in a way where their absence means so much. I don’t want anyone to feel like their grief is wrong. Someone might read his obituary and feel something: they might feel a stage of grief - they might feel denial things like this happen, or anger, or anything. Never downplay your own grief because you don’t know the person well. Get help if you need it. It’s okay to talk about it. Please feel free to ask me about Mark, I love hearing the sound of his name. If someone asked me March 12th next year, hey, it’s been one year since you lost Mark, I would be so sad but also so happy people remember him. \nDon’t tell me your brother is pissing you off. I don’t have a brother to piss me off anymore. If you have a sibling, if you have a parent, a friend, call them and tell them you love them. In the darkness of this all, there is the potential to laugh. My goal is to make", "image": "./photos/1758229402338310357.jpg"}, {"caption": "\"Mark was an incredible man. He was so good at everything it was almost annoying. He played the stand up bass in folk bands and with his girlfriend Heather. He was an amazing athlete - he was a skier and he skied moguls like nobody I’ve ever seen before. He hiked the West Coast Trial, he ran our dog every day, he was a great cyclist. And he was so smart. He wasn’t just a 4.0 student, he had an amazing mind and he was going to do great things and inspire so many people. He’d just gotten into a direct entry PhD program, he dreamed of being a professor. I was so excited to fly out to his first lecture as a professor and sit there in the front row, staring up at him. It makes me so sad that there’s a whole generation of kids that will never hear what he has to say. He didn’t halfass anything. He did it and did it well. He drew, he painted, he wrote letters to Heather so beautifully. Mark’s the type of guy there would be halls and university departments named after. He’s still with me in some sense, he’s with me in ways that aren’t tangible. He will continue to inspire me every day and I hope he inspires other people in this way. I hope when someone wins his scholarship, they look up who he is.\" (5/6)", "image": "./photos/1757500126680889351.jpg"}, {"caption": "“The biggest thing that changed in my life is the concept of delayed gratification. Mark was lucky because he did and saw a lot of things that he liked. He went to Europe twice on his own, once with the family. I know that if I died right now, I wouldn’t feel fulfilled and that’s so hard because I’m nowhere near done with my education. It’s hard for me to have goals and motivation. The one word I would use that fits everything that I’ve done, the overall theme of my life, is motivation. I don’t trust that the world will wait for me, and now I feel like a shell of a person. I am passionate about many things and I feel like I’ve lost the spark that ignites me. I’m not a determined student, advocate, or volunteer at this point, and losing that is so hard. I have to find the piece of myself that is missing. \nWhile I’ve lost my drive, this reaffirms my passion and need to go into medicine. While I’m grieving and I feel like I have no drive, I see my mom and my dad hurting, panic attacks, crying. I get a lot of comfort from helping them. My dean asked me about whether I’d be ready to go into medicine. She said, if you saw a young man with injuries like the ones your brother had in Emergency, would you able to handle it? As much as I’ve lost a lot of my spark, the way I see this is that it is a chance to win back another life, an opportunity to tell this unfair world that people can still fight to keep their loved ones here. When I think about my parents and my family, it inspires me to help other families and be a part of someone’s story, ensuring their family never has to feel this way.” (4/6)", "image": "./photos/1756824976704864258.jpg"}, {"caption": "\"Mark and I grew up in Scenic Acres, so when we were kids we spent a lot of time by the ravine. We’d ride our bikes together, we would build lots of forts. We used to fill kiddie pools in our backyard with water from the garden hose. You know how our July evenings can get cold? One day, when Mark was probably about eight, Mark said he remembered reading somewhere that the ground would still retain warmth from the day’s sun. We decided to build our own ‘hot tub’. We dug a gigantic hole in the lawn, and filled it with water from the hose. We then sat there in this mud pool, determined to enjoy something that we had spent so much time making. Dad was pissed when he saw us and the gigantic hole in his meticulous lawn. \nThis is one of my favourite memories. My parents never put pressure on me, but I put more pressure on myself because now I’m the only Grosjean and I’m now living for two. I have this theory about memories - that if two people are part of a memory and both people forget it, it’s like the memory never happened. And all these childhood memories that Mark and I have, I’m relying on me and my parents to remember, and when they’re gone, it’s only me. If I forget something, it’ll feel like it never happened.\" (3/6)", "image": "./photos/1756096368042379563.jpg"}, {"caption": "\"We came back to Calgary and the funeral was the following week. That week of time was the biggest blur of my life. A lot of people came in and brought food, which was amazing because we had no will to do anything. I’m amazed by the kindness of best friends, the kindness of strangers, and everyone in between. People who I’ve never talked to messaged me, and offered to help at this time. It’s sad that things like this bring out the best in people. I’m simultaneously restored in the faith of what people can do, but so angry at what this world can do. This world is unfair and people are all you can depend on. You don’t know what tomorrow can bring, but you know who you’re surrounding yourself with.\" (2/6)", "image": "./photos/1755575199681743189.jpg"}, {"caption": "\"I woke up Monday morning and at 1 pm, I got the call that I was never going to see my brother again. When my mom picked up the phone, I heard her sobbing. My first thought was, oh maybe my dog got hit by a car, or my dad had a heart attack. It didn’t even cross my mind that my 22 year old brother would have died. He hit a tree in a severe ski accident and never woke up. The part that makes me most sad was that my mom was the first responder. She had to hold her dying son, and on the phone she was telling me how sorry she was that she couldn’t save him.\" (1/6)", "image": "./photos/1754611863515422919.jpg"}, {"caption": "Thanks to everyone who came out to our Humans of UCalgary x Scholars Academy Event last night! It was amazing seeing the connections being made and getting a chance to hear some of the amazing stories that were being shared. We're so glad to have had you join us for our Human Connection: Night Event to help make our vision a reality. We'd also like to thank our wonderful speakers again, Jill Drader and Rita Egizii for coming and sharing their stories with us. \nBe sure to look out for information on our next event which will be coming up in April! We look forward to seeing you all soon!", "image": "./photos/1741585533321388668.jpg"}, {"caption": "“We’re researching how children develop understanding of their language. One of the longest studies we’ve undertaken here is called Babysibs. In this study, we work with younger siblings this disorder of children diagnosed with Autism Spectrum Disorder to identify possible early markers of this disorder by carrying out a series of speech perception tasks and standardized tests over time. The studies takes a lot of time because we observe the children at various points between the ages of 6 and 36 months.” “For the study I run with 15 month-olds, I always ask them if they wanna high five me. At one point, I had a streak of 19 high-fives in a row!”", "image": "./photos/1731590133536776516.jpg"}, {"caption": "“I’ve lived here all my life but I have family in Edmonton and BC. Since my parents have the biggest house of all my extended family, we often host the parties. Because most of my cousins are younger than me, I’m usually the de facto babysitter!”", "image": "./photos/1727182728661881724.jpg"}, {"caption": "\"For me, dance is a framework where I can learn more about myself. My foundation is freestyle, whether in showcases or competing in battles. Freestyle allows me to take risks and explore boundaries within my movements. By immersing myself in the music that’s playing, while still remaining true to my style, I learn the most about who I am in that moment. Ultimately, my purpose as a dancer is for others to experience my emotions as their own, and to become an inspiration that drives them to be themselves through whatever medium they explore.\"", "image": "./photos/1723579433460495271.jpg"}, {"caption": "“She’s compassionate and humble. Anything she does is driven by passion and reason, and she’s literally the smartest person I know! I think she doesn’t give herself enough credit, but instead works even harder.” “I can always talk to him when I have problems. He’s caring and always puts a positive spin on things. Since I moved here from Ontario, he’s become a supportive pillar in my life. He's also very admirable with his mindset of always moving forward.”", "image": "./photos/1714963976579066634.jpg"}, {"caption": "\"If you could win at anything, what would it be?\" \"In the context of sport, I want to be in a position to help somebody win a gold medal. Otherwise, I want to win a gold medal in living life. I would like, at the end, for someone to come and put a gold medal on my coffin and say, 'this life was the best, it was wonderful'.\" (3/3)", "image": "./photos/1712716046933667101.jpg"}, {"caption": "\"Sometimes people think basic self care is wasting time. I like my brain a lot so, I have this rule for myself: try not to give the time that I should be spending on myself to other people. It's very easy to say 'yes' when people ask you to hang out, but it's important to be by yourself too. It makes me sad I don't do it more.\" (2/3)", "image": "./photos/1712715297075906923.jpg"}, {"caption": "\"Hypothetically, I want to live until I'm four hundred years old, assuming that I can stay functional. I don't like the idea of being immortal because then things would lose meaning. But, the human lifespan is also pretty good. A normal lifespan is long enough if you make an effort to use it well. Looking back, I really should have bought a bike and rode it to Vietnam or some place like that, but I didn't because 'adulting'.\" (1/3)", "image": "./photos/1711265438322087505.jpg"}, {"caption": "\"When I was growing up, there were always a lot of questions along the lines of 'What are you gonna do with your life?' But it was better not knowing the answer right away. It made more sense to explore and figure it out along the way. I’m now working in the health sector, but if I wasn’t working here I probably would have been in business - a career quiz led me to that idea.\n\nI’ve learned that you should be proactive with your career and who you are. Seek out choices, and utilize the resources available to you. Find out what works for you. It’s just like in health: it’s never as easy as telling someone to simply 'go get help.' Take honest, truthful steps to get to your goal. People will always have different paths to take. Reaching out for help might be the hardest at first, but it’s the easiest in retrospect. The more we ask, the clearer the way opens up.\"", "image": "./photos/1709818446441882548.jpg"}, {"caption": "“How would you define your friendship?” \"It's having deep conversations with one another, but also making fun of each other without fear, since we've been very close to each other.\" \"Friendship is also giving some Halls candy when you're coughing. We especially bonded over the time when we were taking Grade 12 English - also known as hell.\" \"There’s also a lot of dark humor involved.\" \"And K-Pop.\"", "image": "./photos/1705451146024751020.jpg"}, {"caption": "“I’m in the symphonic band here mainly because of my band teacher. I returned my rented French horn at the end of grade twelve, and she told me “you’re too good to stop playing”, then gave me a horn that another teacher’s wife had donated to the school. I couldn’t pass it up.”", "image": "./photos/1703307839039386747.jpg"}, {"caption": "“My grandpa was an incredible man. He was a prominent doctor in central Vietnam and he managed a hospital in Hue. Even after the new regime took over the country in the 60’s, they let him keep his position. Thousands of people went to pay their respects at his funeral after he passed away last year. \nI’m in health sciences right now. It would be amazing if I could become anything like him.”", "image": "./photos/1698266689274472713.jpg"}, {"caption": "“My dad is an addict and it’s too late to do anything about it. He hasn’t been in my life in a really long time and I’ve been feeling melancholy about that. It makes me a little upset that I can’t do anything to help him, as it would be somewhat last minute now. This is why I’m in the community rehabilitation program at the University of Calgary. I’d like to go into occupational therapy because I want to know what I could do for people like my dad, so that they can live long, happy lives and spend as much time as they can with their loved ones.”", "image": "./photos/1686683731476371714.jpg"}, {"caption": "\"Straight out of high school, I moved from Georgia to California to play college football.  I was glad to leave Georgia. I don’t think people realize it, but where I’m from people can be aggressively racist and it's hard to feel safe anywhere. Junior college was tough too, though. There was a time where I was homeless and didn’t know where my next meal would come from.\n\nEveryone comes from a different struggle. But at the end of the day, I have a son to feed and that’s what keeps me going. I want to provide him with a better life than I had. I hope to do this by getting drafted to the NFL. My former coach and mentor Dante Marsh always says “How can they beat you if they can’t out work you?” This saying is a constant reminder to me to not only better myself on the field, but also in life.\"", "image": "./photos/1679388340183889677.jpg"}, {"caption": "“Teyam is a glass half-full kind of person. An opaque glass, half-full of orange juice. She’s crazy. You’d expect to find water but instead you find orange juice.”\n“What?! What’s crazy about me?”\n“What’s not crazy about you?”", "image": "./photos/1669258485408670469.jpg"}, {"caption": "“Do you want to be a doctor?” “In time. I want to really live my life first. There’s places I want to go see, experiences I want to have. This sounds dangerous but I want to hitchhike in Europe. I want to drink in an Irish pub. I want to study my ass off at a library that some of the greatest minds in history have also studied in. I want to see places and meet people. I feel like I’ve been held back in the sense that I’ve always known what I should do next. Nothing’s forcing you to do third year after second year but it’s always been obvious to me as the next sequential step. There’s not much room to live and experience. When you go to med school, you can’t hit the pause button for three months. And that scares me. I want to make the most out of my youth - am I still considered a youth? - before I’m tied down by other circumstances. These past few years have gone by so fast. Next thing I know I’ll be 25, then 30, then 47. I need to go explore.” (3/3)", "image": "./photos/1668637559151373548.jpg"}, {"caption": "“In health sciences, it’s such a privilege to study with people who are genuinely passionate about everything they do. People volunteer dozens of hours a month because they want to make a difference. I have friends that advocate for Syrian healthcare workers and others that sit on councils to improve the hospital experience for kids. At the same time, it’s so difficult to not subconsciously stack yourself up against all of them. I was never one to compare myself to other people, but when you’re in an environment with people like this - it’s competitive and it’s not. It would be easy to be unhappy if they wanted to see you do badly, but they’re all so supportive. It’s not an active ‘I need to be better than them’, but it’s just a check of, they’re doing this, should I also be doing it too? How does my success measure up? It’s exhausting to spend so much mental energy thinking about what other people are doing. It’s not sustainable. It took me a long time, but I’m just going to focus on doing what I like doing to move forward. So I’m also proud of getting past the mental challenge of not comparing myself to others.\" (2/3)", "image": "./photos/1667776732672196157.jpg"}, {"caption": "“What are you most proud of?” “I was part of the Alberta Children’s Hospital Foundation Youth Council, and we raised $20,000 for youth mental health. I guess I could say that. But honestly I think I’m most proud of getting through second year university. I burst an eye vessel before my o-chem midterm, and I burst another one before my o-chem final because I was studying too hard. Now I think I’ve really screwed up my eye vessel because whenever I get stressed it feels like it’s going to pop. I thought there was no light at the end of the tunnel. I was sitting at the library looking through the dozens of reactions to memorize and I felt so hopeless. But I did it. It took two burst eye vessels, but I got through the course.\" (1/2)", "image": "./photos/1667058840406251038.jpg"}, {"caption": "\"We were both drinking that night. I’d said no. I didn’t understand that what happened wasn’t okay. I didn’t tell anyone for a long time, and my relationship with my parents was strained because of it. I was angry and sad, and they didn’t know what was wrong - I didn’t know how to express it. I started talking to my cousin and she let me take my own time to heal. I finally realized that if I wanted a healthy relationship with my parents, I’d have to tell them everything. They were very supportive in the end. \nOnce I came to terms with what happened to me, I started to advocate for consent and sexual health. That’s where my passion stemmed from, and it’s something that I want to carry on doing. I’m trying to make sure that other people feel comfortable coming forward. It’s important to support them and say, ‘I believe you’.”", "image": "./photos/1665684802127617051.jpg"}, {"caption": "\"When I was fourteen, there was a protest against the demolition of an apartment complex that I delivered newspapers to. They were older buildings that typically housed the poor or elderly.  The city was going to demolish them to construct the Calgary Municipal Building. However, the city didn’t realize that they weren’t just run-down old apartment buildings, but they were a tight knit community.  I decided to try and capture that by taking portraits of the residents and their community involvement.  Together with other protestors we built a story on it and sent it to City Council. Unfortunately, that didn’t stop the inevitable demolition, but it caught the city’s attention and they were able to negotiate a community relocation of the residents. That was when I realized I wanted to pursue photography. \nNearing the end of high school, I applied for a photography scholarship at the Banff Centre School of Fine Arts. I was granted the scholarship, but at a cost: due to conflicting semesters I had to drop out a couple months before my high school graduation. I did it without regret and it was there I met world renowned photographer, Peter Sanders. He offered me a job after I finished arts school, but I countered that if I could work right away I would drop out in a heartbeat. Next thing I knew, I was being flown around the country doing work for the Rolling Stones and Time Magazine, photographing bands and artist like the Ramones and Ted Nugent.\"", "image": "./photos/1664190113142715496.jpg"}, {"caption": "“Downtown Calgary is a great place to explore. You don’t even need to use Google. Just walk around and you’ll find a lot of cool places. There’s this bakery by Victoria Park station that I think is a great place for cute dates. It’s called the Manuel Latruwe Belgian Patisserie. \nI took my friends there and we walked all the way from City Hall to Victoria Park station because I didn’t know there was a Red Line!”", "image": "./photos/1663274171663483525.jpg"}, {"caption": "“I’m currently in business, but I want to be a lawyer in the future. I read that finance is a good place to start.”\n“How did you find that out?”\n“Google!”", "image": "./photos/1662899709118212607.jpg"}, {"caption": "\"His name is Yousef and I just love him. He was only a year old when his dad passed away. His mom abandoned him because she wanted to experience life and get remarried while she was still young. He lives with his grandmother now, who’s old and has no income of her own. \nI don’t know why, but I feel responsible for him. He’s only four years old. We facetime every day and I’ll be visiting him this month with lots of gifts. He’s my cousin, but I treat him like my child. I hope he grows up and gets an education. Without it, he might end up joining a gang- the same kind that shot and killed his dad.\"", "image": "./photos/1661904571327778378.jpg"}, {"caption": "\"When you're a teenager, you only see the downs of living with your parents. But then, you realize that parents are more than just machines that raise a kid and move on. When my dad was brought to the hospital because of an abscess in his spine, I realized how much he's been there for me ever since I was born, and that now it was time I make sure that I'm there for him. There should be a balance between support from parents to their kids and from kids to their parents. It's what brought our family together.\"", "image": "./photos/1660570700950624790.jpg"}, {"caption": "“When I was in first year, I wasn’t enjoying university. I felt lonely because lots of my friends from high school moved away, and I was too focused on my courses to make new friends. I knew something needed to change because I was seriously considering leaving university. That feeling of isolation didn’t go away until I got an email from the Haskayne Students’ Association. They were looking to recruit new members, and this came at a really good time because I felt like I had ideas that would help other students who were also struggling adapting to university. \nThe HSA called me back to join the House System Task Force. Joining the team was the first time I really tried to balance my academics with other activities. Working on the house system helped me get through those difficult classes because it gave me something to look forward to outside of my course work. I really tried to step up during the house system and was eventually elected HSA President. The HSA inspired me to continue with student leadership as SU Haskayne Rep and now as SU VP OP-FI. \nAll of this taught me that you’re not always going to like everything that you do, but sometimes it’s not really about what you’re doing. It’s about how you get through it - and you can get through it - that defines you as a person.”", "image": "./photos/1659801048163242513.jpg"}, {"caption": "\"I’ve been solving Rubik's cubes since eighth grade, junior high. I remember how I found one just sitting in my room and I decided I should try it. I gave it a couple tries and it didn’t really go anywhere. Eventually, I watched some videos on how to solve them and taught it to myself in about 10 minutes. Years later it’s something I’m doing every day. I find it’s a good way to relieve stress and kill time. On my own, I’ve beaten the world record for fastest time to solve a cube, but it has to be in competition to count, so I'm not in any record books yet. \nI usually bring a couple cubes with me most places I go, but I have more than 100 different kinds of cubes at home. The biggest one I have has 12 sides, 9 layers, 1212 stickers on it, and takes me about 3 hours to solve. The regular 3x3 cube has 43 quintillion combinations. If you put all the combinations on pieces of paper, you could line them up to pluto and back over 360 times. Basically what I have to do is find that one sheet of paper that has the combination. The 7x7 has more combinations than atoms in the universe, and if each of those atoms in our universe had their own universe of atoms, still only one of those atoms represents the right solution.\"", "image": "./photos/1659119590725407225.jpg"}, {"caption": "“My dad grew up in India as one of seven siblings. When he was a child, he was the only sibling given up to an orphanage for the disabled - even though he wasn’t disabled himself. This was because his family didn’t have the means to support him. When he was 22, he came to Canada. Eventually he gathered​ ​enough​ ​money,​ ​reconnected​ ​with his​ ​family,​ ​and​ ​sponsored​ ​all​ ​six​ ​of​ ​his​ ​siblings​ ​and​ ​his​ ​parents.​ ​My​ ​dad​ ​is​ ​now​ ​a​ ​successful​ ​businessman​. He built a college right next to the orphanage where he grew up, and has​ ​a​ ​registered​ ​charity​ ​that ​helps​ ​provide​ ​free​ ​college education​ ​to​ ​orphans​ ​in​ the community. \nMy dad has shaped me into the person I am. My personal goal is to be a more loving person, not only to others, but also to myself. I want to treat everyone with open arms whether I know them or not. I want to be welcoming at all times and never stop smiling. It’s so important for me to not complain as much as I used to and to be grateful for everything I have. I’m fortunate to have visited almost a dozen different countries and experienced tons of different cultures. I’m planning to go to law school in the future, but to me, it’s not about making money, it’s about giving back to my community. If we can spend money to make someone else’s life better, then why not? We can work hard to make that money back, but who knows where it could lead them?”", "image": "./photos/1658582624200271630.jpg"}, {"caption": "\"Forgetting who I am is one of my greatest fears in life, and after a rollover accident that should have cost me my life, that was very much my reality.  Suffering from partial memory loss, I came to a realization: moments are fleeting, and what’s really important are the memories and bonds you share with others. That is what sparked my wanderlust. No matter where in the world I travel to, people are my refuge and community is my home.\"", "image": "./photos/1657677048750316907.jpg"}, {"caption": "“What makes you happy?” “Being able to praise and worship God. He is my source of joy, love, and everything in between.\n\nGrowing up, my parents were of the faith. My youth was embedded in it, but I didn’t know as much back then. Joining a youth camp made me learn more about faith and God through praise, worship, and friendship. Really knowing God is the start of the journey.\n\nImplementing the faith is something beautiful. There’s this thing called the “beautiful yes:” being able to say yes to God consistently. I used to be peer-pressured to do stuff, but I didn’t find authentic joy there. I was looking at the bigger picture. \nWhat we feel doesn’t always make sense, but I say yes to God’s call.”", "image": "./photos/1655594188186973526.jpg"}, {"caption": "“Being involved in nephrology has made me realize that I have a place in this world where I know I can make a difference. It has made me feel responsible for being a voice for my dad. \nRight now, my dad’s health isn’t improving. Both of his kidneys have failed. Dialysis is a life saving treatment, but it is not a cure. It’s also very painful. My dad gets cramps and uncontrollable twitches in his arms and legs. Dialysis will be the only treatment until he is matched with a donor.” (2/2)", "image": "./photos/1653347174510302862.jpg"}, {"caption": "“I didn’t realize how serious my dad’s kidney disease was until over a year ago. It’s been a part of my life for the past twenty years - it’s something that’s become normal to me. I can remember the exact day I realized how fragile everything was. That morning, we dropped him off to get his catheter for peritoneal dialysis surgically inserted, and I was just heading to work in the building next door. \nI was a research assistant looking at the trends in the management of Chronic Kidney Disease. That particular day, I was looking at data on patients that started with peritoneal dialysis as their first mode of dialysis. I remember sitting there and trying to write my paper, and I realized that my dad would have been a part of my project - one of the numbers - had he started his dialysis a couple of years ago. \nAt that moment, the numbers that I was looking at weren’t just numbers anymore. There was a story behind every single one of them. That one data point was someone’s entire life.” (1/2)", "image": "./photos/1652584735380407567.jpg"}, {"caption": "I’m in the process of learning from a few of my struggles. It's been a long road and I'm still making my way through it. This might sound corny, but you’ve got to find the silver lining. If you can't find that, not only is the pain going to be worthless, but you’re not going to learn anything. Not everything is handed to you, not everything is easy. That's why they call life a struggle. \nOnce you find meaning in it, you’ll start to become a different person.", "image": "./photos/1645936417661337242.jpg"}, {"caption": "\"My brother, Steven, introduced me to Bitcoin. We started investing back when it was only worth around two hundred US dollars, now it’s worth five thousand dollars! I really respect him and commend his incredible charisma and business skills.\"", "image": "./photos/1644612641053092279.jpg"}, {"caption": "“Alzheimer’s disease is difficult to diagnose. So while a family can be fairly certain, there currently isn’t a way to provide a definite diagnosis and provide the family with time to prepare to take care of the patient. My grandpa is currently suspected to have Alzheimer’s. He lives with my family back in India. My aunts and uncles try hard to take care of him, but they aren’t always home and my grandma has her own health issues. This poses certain issues for him and the rest of the family when taking care of him; but we all really want to make sure he's as safe and comfortable as possible.\n\nI’m currently a master’s student working in the BioMEMS and Bioinspired Microfluidic Laboratory. We’re working on developing a device that can detect Alzheimer’s earlier. This would help families find answers and adjust earlier to the financial and emotional demands of the disease. I’m really passionate on working on this project not only because it’s a personal one but because it’s applicable to so many families in the community that I am surrounded by. I would really love it if I am able to help people in some way or another facing these issues.”", "image": "./photos/1639442701870365618.jpg"}, {"caption": "\"I came here from Serbia when I was one and a half years old. My hometown was being bombed by NATO soldiers, so my parents decided to leave and move to Canada. I lived in Calgary for seven years and then we went back to Serbia and Bulgaria. I have been back in Calgary for the last five years.\n\nBack in Bulgaria, I had a really good friend in eighth grade. He was way older than me so I don’t really know how that happened. We used to take long walks in the city of Sofia and talk. I have no idea where he is now. Last I heard, he went to Spain to become a pilot.\n\nI'm currently in first year Engineering. It's kinda alright, I guess. It’s hard to meet people in university since everyone’s so focused on what they’re doing. \nSometimes it’s hard to feel like you belong.\"", "image": "./photos/1635846681236286274.jpg"}, {"caption": "“In Junior High School, one of my goals was to leave Calgary for post-secondary- to take advantage of the opportunity to explore.  It had stuck with me ever since and, before I knew it, my gap year was over and I had to make a decision.  I was set to go to the University of Victoria for Microbiology. I had everything prepared and the last thing for me to do would be to go.  In a turn of events, I got an acceptance email from the University of Calgary for a BSc in Psychology, which is something I’ve been passionate about since Grade 10.  I’ve always been fascinated with human behavior, how people think, and the motives behind our actions. \nAfter hearing the news of my acceptance, my parents wanted me to stay in Calgary. Family has always been very important to me. Last summer, I got the chance to visit Pakistan and my extended family for the first time in seven years. When it came down to it, I realized that my decision wasn’t only about myself, but also those who would be impacted. I decided to stay in Calgary to pursue my passion for psychology and to keep my loved ones close.”", "image": "./photos/1633106304104375771.jpg"}, {"caption": "\"I’m the best procrastinator you’ll ever meet. I’ve been playing Geometry Dash and Solitaire on my tablet for almost two hours. I should probably be getting some work done though! I’m good at leaving things until last minute, but that’s okay because I can handle it. That’s just my workflow.\" “What do you have due?” \"Just some assignments and a paper. Oh boy, I hope my profs don’t see this.\"", "image": "./photos/1630117149908774826.jpg"}, {"caption": "\"I find studying human movement amazing because it's interactive and fun. My philosophy is to keep everyone moving - this is why I study Kinesiology. I like to carry around an orange ball that I throw to random people, which usually results in an intense game of catch! It also makes people smile, so I might also throw it around to anybody who looks bored or just needs a little bit of cheering up. \nI'm majoring in Leadership in Pedagogy & Coaching where I'm learning how to teach and share my passion for physical activity, especially with kids. I want to break down barriers that might exclude kids with disabilities from participating in physical activity.  I'm currently volunteering with the Adapted Physical Activity for Kids program, and today we finally met the kids that we were paired with! We played a lot and worked on identifying their goals. It was awesome.\"", "image": "./photos/1628621591092354203.jpg"}, {"caption": "Kevin Gardner, B. Commerce in Marketing (1985) “I was connected to CUS and I remembered that one of the guys owned a sod company. So near the end of the term, we had the brilliant idea to haul sod up to the eighth floor of the Earth Sciences building to build a mini golf course. We even built water lagoons with little goldfish. Because it was a fundraiser, we charged two bucks per person to play. But, it got a little out of hand. We spent all night cleaning it, and the university administration still wanted to charge us for a professional cleaning service even though we left it exactly how we found it. The bill was astronomical, but Dean Michael Maher thought it was so cool that we built this golf course that he said, “Don’t worry, I’ll cover it.” And that’s how the Golden Dino award came about. The Commerce folks had an award night called ‘Year End Dinner and Dance’. I was invited specifically to present the Golden Dino award, a plastic Flintstone dinosaur painted gold, to Dean Maher for generously paying the cleaning bill. I just had such a tremendous amount of fun while in Commerce! I left with so many fond memories of my time.”", "image": "./photos/1627345594745230284.jpg"}, {"caption": "\"I really wanted to move to Canada. My mom's originally from Calgary, so I visited Calgary every year growing up. People are a lot less confrontational here; people aren’t as angry all the time. In the States, there’s some sort of superiority complex. I had a Social Studies class where all we talked about was America’s history. We never really learned about other countries in the world. \nWhen I was applying to schools in grade 12, I applied to the University of Calgary and Mount Royal University. I remember getting my acceptance letters in the mail. I burst into smiles for the rest of the week. \nAt some level, I’ve always wanted to move to Canada. I feel a lot happier as a person, I'd say I’ve become a lot more outgoing here. I feel more connected.\"", "image": "./photos/1625703185712081167.jpg"}, {"caption": "Jeremy Ho, B. H.Sc (2009) \"For my entire life, I thought I wanted to be a doctor. I joined the prestigious health sciences program thinking it would usher me into medical school. After second year, I went to Tanzania as part of the global health program and ended up returning there for the next six years. I was doing a lot of things that you guys are probably doing now - volunteering, research, trying to do things outside of being a health sciences student. In the process, I started working part time as a barista and became very interested in coffee.\n\nI applied for medical school, I got an interview. I went to the interview, got out, and I thought I rocked it. I didn’t get in. I was crushed but it opened a lot of doors for me. I continued to pursue coffee on the side, and competed in the Canadian National Barista Championship. Because I didn’t go to med school that year, I was able to attend the World Competition and a lot of opportunities opened up. I applied for medicine a second time. My Dean told me the average applicant tries 2-3 times before they get in. I got another interview and I thought it might be my time. I came out and I thought I rocked it. \nAs you can see, I’m still not a doctor. But business opportunities came up, and I ended up following my passion for coffee to start Monogram Coffee. I’m don’t work in health but I’ve taken lessons from the program to where I am now.  I look at business in terms of doing projects - the project lives or dies via how you perform. Every business project is essentially the same: there aren’t infinite resources, you have a problem to solve, you have a product to get out. You see the same things in a research project - it has to operate, it has to produce something good. You know, I wish I paid more attention in organic chemistry. You never know what you will need in the future.\"", "image": "./photos/1618508248100799325.jpg"}, {"caption": "“Besides death, I’m probably most afraid of languishing. Languishing as in living every day like it’s the same, being in an environment where I’m not having new experiences, not challenging myself. Life should feel vibrant, not like going through the same motions over and over. Routines are important in grounding what we do. We don’t need to learn a new way to brush our teeth each day. But the comfort zone isn’t a place where we grow.” “How do you deal with this fear?” “I’ve wanted to journal for about a year, but only started doing it daily three months ago. I’ve already filled up a notebook. On the left half of each page, I write a day plan. On the right, I reflect on three parts of my day: what I did well, what I could do better, and how I want to approach the next day. This is my way of practicing mindfulness and making sure I’m conscious of how I act and behave. \nJournalling might only help me grow 2% each day, as opposed to 1% without. But growth builds upon itself – it’s an exponential curve. And, in the long run, 1.02^n grows much more quickly than 1.01^n. That exponential growth leads to transformative improvement over time.\"", "image": "./photos/1617056723512049712.jpg"}, {"caption": "\"I didn’t really know about anxiety until last year when I had my first panic attack. It started while I was hanging out with my friends. One moment\n you’re happy and the next everything feels like it’s caving in. \nThe way I started dealing with things was by talking to my family and my friends. I think that if you are going through this kind of situation, it’s super important you talk to other people because it helps you get to the root of your issues and learn a different perspective. It’s eye opening, and really important to have people who are willing to listen to you.\n\nThe reason why I joined Outrun the Stigma is that I wanted to work towards creating a community that is willing to offer support. I think everyone exists on a spectrum, and everyone deals with issues in different ways. If we are willing to support one another and open up to hearing others’ stories, we can learn to face adversity together.\"", "image": "./photos/1616320521498449436.jpg"}, {"caption": "\"I was lost - very lost with what I wanted to do prior to university. I always wanted to be a doctor but people kept telling me to do certain things to become one. Their advice always confused me, and I didn’t know if I should listen to them. That’s why when I got to university, I had an existential crisis.\n\nMy TA told me to drop out of my degree during my first lab. I didn’t want to show that it affected me, so I made it seem like I was taking it\n as a joke, but I questioned whether it was true or not. I’d always question if I was good enough or confident enough to make it in that path.\n\nI was fortunate to have my research published four months ago and that means a lot to me. It validated my choice in my Science degree, and it made me more confident. \nPeople are going to say some mean things but they’re not necessarily true. I want to help others achieve their goals and become more confident by talking about my own story.\"", "image": "./photos/1615789955590092138.jpg"}, {"caption": "Leighton Wilks, B. Arts. in Psychology (2000) “What made you choose University of Calgary?” “I’m an anomaly in that I did all my degrees at the University of Calgary -  Bachelor’s, MBA, and PhD. Now I’m here at Haskayne teaching. \nDoing my undergraduate degree here just made sense. I had a fantastic supervisor for my other two degrees - Dr. Julie Rowney. She was a super mentor to me and it was her that made me want to keep going on. She was the first woman faculty member hired here in Haskayne! \nJulie was always there to support me when I needed it and was also very hands-off when it was necessary. It was her guidance that really helped me. She gave that kind of advice that can only really come from someone who has had a lot of experience. The way she treated me really guides how I treat my own students now. \nI often think that I should just get a plaque that says “WWJD?” - What Would Julie Do?” (2/2)", "image": "./photos/1613414458176525564.jpg"}, {"caption": "Leighton Wilks, B. Arts. in Psychology (2000) “Employers are no longer looking for a 4.0 student. They want people who are unafraid to do interesting, unconventional things. \nYou gain such a wealth of knowledge by going overseas. You could go, come back, and then know what you want to do and get out of life. During my undergrad I left for a semester to travel to Europe, and when I returned I knew what I wanted to get out of school and it helped me realize where I wanted to go. I think too many people are focused on starting their career. They might not realize that this is the best time to get out there and embrace something new, and maybe discover what you want to be in the future. \nNow I work as an Instructor with the Haskayne School of Business and it has been amazing to give back to the program that has taught me so much. \nI came to love teaching cross-cultural studies from the great influence of a professor named Dr. Skarlicki. I can remember the exact day he spoke of it in a lecture, a light bulb flicked on in my head and I suddenly knew that was what I wanted to do. Now I teach a cross-cultural business course in Japan, and I took 22 students there in May! \nI never reached out to Dr. Skarlicki to let him know how much he influenced me. And it’s odd to think that we, as professors and instructors, might not realize the kind of influence we have on students. \nSometimes I worry that I play the same role that Dr. Skarlicki did in the lives of my students, that I could impact somebody’s entire life and I would never know.” (1/2)", "image": "./photos/1611960879091633333.jpg"}, {"caption": "“My dream is to become an astronaut. Space exploration is fascinating to me. Right now, I’m doing research with the University of Calgary iGEM team, and we are developing a process to produce bioplastics on Mars from solid human waste feedstock using genetically engineered bacteria. \nBecause I want to be an astronaut, people often ask why I chose to do chemical and biomedical engineering  rather than mechanical engineering. People think you have to go down a certain path to become an astronaut, but after talking to a few astronauts myself, I realized that’s not the case. Many astronauts have told me that doing what you love and doing it well is more important than attempting to follow someone else’s path to success.”", "image": "./photos/1608318975120696514.jpg"}, {"caption": "Nicole Fung, B. Comm in Accounting (2010) \"I was born and raised in Calgary, so I wanted to try something new. I moved to Edmonton to study science at the University of Alberta because I thought I wanted to go into pharmacy, but I hated my first year so much that I ended up transferring. I decided to apply for business at U of C because I figured I could attempt climbing the corporate ladder. But I still wasn’t enjoying my career choice, dealing with numbers and spreadsheets every day. \nAfter graduation, I spent 6 months travelling, visiting Hong Kong, Australia, Japan, Korea and more. I just kind of decided: let’s do the things I want to do. Experiencing new food and travelling were always hobbies of mine, so I decided to create a food blog and Instagram to shared the different foods I enjoyed at various cities.\n\nTo my surprise, people really responded to it! It got to a point where updating my blogs and Instagram became a sustainable full-time job, and I couldn’t be happier.\"", "image": "./photos/1603944416804318947.jpg"}, {"caption": "Breanne Everett, M.D. (2009) “I never imagined that I’d be starting a company like Orpyx. In retrospect, I’ve always been interested in innovation and entrepreneurship, since it’s the perfect storm of events, desires, and people involved. But I’ve always been drawn to the sciences first and foremost. I never went into my medical residency thinking this would happen. \nRight now, our medical system is focused on reactive care instead of proactive, preventative medicine. I really want to see the shift to preventative technologies and medicine, because eventually our economy won’t be able to support reactive strategies. When I was completing my residency, I saw so many diabetics undergo unnecessary amputations. This could have been avoided if only they had the proper tools to regain sensation in their feet. Orpyx creates footwear that bridges this gap, by giving the patient real time feedback from sensors on their feet. \nI couldn’t have done this without the support from both the business and medicine faculties here. When I decided to step out of my medical residency, I had the complete backing of the university. My biggest fear was taking the risk of stepping aside and creating my own path to start a company. But this has been the most challenging and rewarding thing to do - creating my own trajectory. \nWhen life gets overwhelming, I usually ground myself with a tactic they taught us in med school. They always told us to take your pulse before before entering the trauma bay or an emergency situation. This grounds you. It reminds me that you don’t have control over everything and that you don’t know everything, but you can do the best with what you know.”", "image": "./photos/1593148169816910934.jpg"}, {"caption": "Shawna Trudel, B. Sc. in Kinesiology (1987) \"I remember sitting in Science Theatres in 1981 when someone suddenly ran in and yelled, “We got the Olympics!!” The entire lecture hall was filled with yelling and whooping. The following years, they began building Kinesiology B and the Olympic Oval. The renovations resulted in so much dust that the area was nicknamed ‘the dust bowl’. But I didn’t care, it was such an exciting time for Calgary.\n\nIn my last year of university, I worked with Athletics and found out they were hiring at the Olympic Oval. I originally wanted to work as a physical education teacher, but the opportunity to work on campus during the 1988 Olympics was irresistible. The experience was so exciting - I got to see behind the scenes. They hosted Entertainment Tonight and it was filled with celebrities. It eventually led to me working on campus for the rest of my career.\"", "image": "./photos/1588903315177218622.jpg"}, {"caption": "“If you could tell your first year self one thing, what would it be?” “I would tell myself to not buy any textbooks, unless assignments are associated with them. Even then, you could always borrow them from somewhere else. In my first year, I bought brand new textbooks for basically all my courses, and I didn’t open most of them more than once. Don’t cut down trees and don’t waste money unless you really need it for a course.\n\nAlso, make sure that you’re taking your courses with a professor that you think you'd be able to gain from. Sit in on lectures in the first week of classes and  know what to expect. Sometimes, some professors are really good for some students and really bad for others. You just have to know what kind of professor you need.\"", "image": "./photos/1582953639345384057.jpg"}, {"caption": "Dianne Tapp, PhD in Nursing (1997) \"During my master’s degree, my research project was focused on one question, “How can clinicians communicate better with patient families?” In health care, we sometimes only pay attention to the sick patient. But we often don’t realize that treatment has a long term impact to the entire family in terms of diet and lifestyle. \nEnabling families to communicate with one another about what distresses them helps everyone, including the patient.\" Subscribe to our weekly newsletter: http://bit.ly/SubscribetoHumansofUCalgary", "image": "./photos/1573527205581341426.jpg"}, {"caption": "Robert Thirsk, B. Sc. in Mechanical Engineering (1976)\n“What memory sticks out from your time at the University of Calgary?”\n“Definitely my classmates. The U of C was a smaller school in the 1970s. My 1976 mechanical engineering class included only thirty students. We learned and worked together late into the evenings and on weekends on assignments and design projects. When I handed in a problem set, for example, my name was on it. In reality, I could’ve listed several other names - we helped and depended on each other.\nMy engineering undergrad was an intense program that created a tight bond between my classmates. This bond has continued over the years such that we stay in touch. Every second Tuesday of each month, the Calgary-based classmates get together for breakfast. Last year was our 40th year reunion, and twenty-two classmates made the effort to attend. A piece of advice for today’s students - get to know your classmates. Help each other out. Likewise, get to know your professors. There’s some professor on campus who wants to learn about your career aspirations and guide you on your educational path. The full university experience should be defined by more than lectures, labs and the C-Train ride to and from campus.\nIf you had asked me when I was an undergrad if I would ever become an astronaut, I would’ve replied no. I’ve subsequently learned that it is okay to dream big, hairy audacious dreams. Admittedly, some career dreams such as astronaut require a lot of education, a lot of knowledge and skills. But be determined and keep moving toward it. You might be an undergrad now but you have tremendous potential. You could become an author, a neurosurgeon or Prime Minister. Don’t limit yourself by dreaming small.” (2/3)\nSubscribe to our weekly newsletter: http://bit.ly/SubscribetoHumansofUCalgary", "image": "./photos/1539703213112266356.jpg"}, {"caption": "Robert Thirsk, B. Sc. in Mechanical Engineering (1976) “How has going to space changed your life on Earth?” “It’s crazy. Prior to my first spaceflight, I talked to many astronauts and read many books about what it would be like to live up there. But I couldn’t possibly understand how it felt to be in space until I was there myself. The view of the earth from space is particularly enlightening. \nOn earth, we look up at the immense blue sky and may think that our atmospheric resources are boundless. From the orbital perspective, we quickly see that is not the case. If you imagine the earth as the size of a basketball, then the amount of atmosphere enveloping our planet is only a thin layer of tissue paper. From space, I saw the fragility and vulnerability of the earth: clear-cut forests resemble a patchwork quilt, ships emptying their bilge tanks into the ocean leave an oily streak in their wake. Prior to my first flight, I wondered if I would be able to see the Great Wall of China. Well, I couldn’t see the Wall from space because China was covered in smoggy haze. I had always been an environmentalist, but even more so after spaceflight. \nPhysiologically, my body has largely returned to normal following my last flight. But my wife tells me that psychologically, I returned as a different person. Whereas community and national matters previously interested me, my wife says that the global community and big ideas now capture my attention. She’s right. I think it would benefit all decision-makers to spend two or three days in space to simply look out the window and reflect on humanity and the fragility of our planet. From orbit, we don’t notice individual countries; we notice only civilization. We gain the sense that all of humanity is one, that we are connected to each other and to nature, and that survival of our species should be governments’ top priority.” (1/3)\n\nSubscribe to our weekly newsletter: http://bit.ly/SubscribetoHumansofUCalgary", "image": "./photos/1538746008682840905.jpg"}, {"caption": "“4 years later, I had been to every small town in Nebraska, from Kimball, to Madison, to even Valentine. I hitchhiked from town to town with my amnesiac sister Dorothy in this fruitless search for my son. \nI was starting to forget what he looked like, what his voice sounded like, and what it was like to have him by my side. The only thing I could remember was the license plate '42WALB'. We got to Sidney with the help of an alcoholic named 'Crusher', and we went to the nearest McDonalds to get some food. In the background, I heard the manager yelling at an employee, 'Why aren’t you wearing your hair net? You keep getting your stupid silver hair in the burgers, you worthless child.' Silver hair? Could it be? I looked over at the counter, tears in my eyes, and I saw my son.\n\nSometimes I look back and think, if it wasn’t for that license plate, '42WALB' there would have been no way I could have found my son - Nemo, in Sidney, Nebraska.” (2/2)", "image": "./photos/1483758694759042342.jpg"}, {"caption": "\"17 years ago, my wife left me after giving birth to our son. For 8 years I lived the life of a single father. I worked two jobs to keep a roof over our heads and to put food on the table, I skipped one meal a day just to make sure I could give my son three, and I was happy. \nBut after years of barely scraping by, I lost him. I took him to the amusement park and he was taken. I remember him screaming, 'Let go of me you butt!' as I saw him being thrown into a white Pontiac Montana that started its engine and drove off into the distance. \nMy son, my entire life, the only reason for my existence, was gone.\n\nWhy would someone take him? He was a very unique child, he had silver hair, Anemonesis, and other medical conditions. The only shred of evidence I had to go off of was the license plate of the van, the Nebraskan-registered licence plate '42WALB'. Everybody told me I was crazy. 'How would you find him?' they asked me. 'It would be like finding a clownfish in the entire ocean.' But if it was the last thing I did, I was going to find my son.\" (1/2)", "image": "./photos/1483563523845111762.jpg"}, {"caption": "Elizabeth Cannon, B.Sc in Geomatics Engineering (1984) \"Prior to starting my engineering studies, there were still some underlying questions from male students who may have thought, ‘Why are you here? Why are you taking the place of a man?’ These questions weren’t necessarily vocalized or pervasive, but they were there. When I entered engineering, there were only a few of us in number, but there was starting to be this realization that more women could do it, and should do it.\" If you'd like to read more of Elizabeth's post for 'Wayback Wednesday,' click on the following link: http://bit.ly/ElizabethCannon \nSubscribe to our weekly newsletter: http://bit.ly/SubscribetoHumansofUCalgary", "image": "./photos/1482341022825455815.jpg"}, {"caption": "Due to high interest, twenty copies of our book will be sold at our book launch event this Thursday (That's tomorrow! How exciting is that) March 23rd for $35 each. \nTo reserve a copy, please visit our FB page to sign up ASAP!!!\nPlease note that all transactions will be cash-only, and no change will be available. \nCheers,\n\nHOUC team", "image": "./photos/1476476835742228066.jpg"}, {"caption": "For the past year, the Humans of UCalgary team has been working hard to release a photojournalism book for everyone on campus. It would mean so much to our team if you took the time out of your day to attend our book launch party! There will be free food, music and a chance to win your own copy of the book.", "image": "./photos/1461061093983084706.jpg"}, {"caption": "\"In the 1980s, when I was in Italy, I visited my cousin who had just had a baby at the hospital there. I came into this humongous room with just babies, mothers, and beds in it. No tents, no curtains or partitions, just beds, mothers, and their babies. It was this scene I saw that spurred my interest towards improving global maternal and newborn health.\n\nI’ve spent thirty years working in the young infancy bracket of child development and growth at the University of Calgary’s Childcare Centre. I’ve learned the importance of having preventative measures for mothers and babies so they don’t get infections immediately after birth. These are the basic needs that a mother needs when going through labour - basic needs that aren’t available everywhere in the world. In developing countries this is an important issue. To fix it, we don't need more money. People think that having money is important, but you can have money and misuse it. We need more people who know how to organize and strategically think of every dollar and every penny that goes into creating a safe environment.”", "image": "./photos/1448001284703964605.jpg"}, {"caption": "\"I remember my parents took me out to play baseball when I was four. Once we got there, I just sat down and picked at the grass, because I really wanted to play hockey. I grew up in Florida and my neighbour would always be practicing hockey on his driveway. He was from London, Ontario and was only a couple of years older than me. For as long as I remember, I wanted to be like him. When I finally became old enough to play hockey, I fell in love with the sport. I find it amazing how hockey is the combination of two elements: physicality and skill. Not only do you have to work for every inch of the ice, but you also have to be highly skilled with handling the puck.\n\nDuring the playoffs last year, I got a concussion during game six. Injuries are definitely the hardest part of the sport. Going through the rehab process was extremely challenging. Concussions in particular are hard to deal with, because you can’t really see or judge how recovered you are. The healing process was complicated and exhausting. I didn’t even know if I would ever be able to play again. But having this experience led me to appreciate the game that much more. When we won the national championships, it was an indescribable feeling. Winning as a team, with the guys - those are the moments you play for.\" #GoDinos #WeAreAllDinos #MyUCalgary", "image": "./photos/1441832209920396912.jpg"}, {"caption": "\"I've been playing hockey since I was five years old. My dad played for the Edmonton Oilers, and even though he never pressured me to play, I've always had a passion and love for the sport. That’s why I was so happy to continue playing while attending the University of Calgary.\n\nI've always noticed that the hockey community is so close knit. Even when you move teams, you form close bonds with everyone around you. We practice, work out, and go to games as one unit. The people I play with on the Dinos team are some of my best friends.\" Good work tonight at the Crowchild Classic Dinos!! #GoDinos #WeAreAllDinos #MyUCalgary", "image": "./photos/1441830589098816183.jpg"}, {"caption": "\"I'm in bioscience and hoping to go into medicine. I also love to provide comic relief. To me, both medicine and laughter are ways of helping others. I've seen a lot of people go through hard times, and laughter is a cheap way to make them feel better.\" “Why do you like making people laugh?” “To feed my huge ego.”", "image": "./photos/1440443485605104133.jpg"}, {"caption": "Melissa Lackey, B. Comm in Marketing (2004) \"I took five years to finish my Bachelor of Commerce due to completing a co-op term in Ottawa. Taking a co-op term means that a lot of people who you started your degree with don’t graduate at the same time as you. But in turn, you get to meet a lot of new people, and you get to have unique experiences in different places. To me, working in Ottawa was the most impactful experience I had during undergrad. It was my first time away from home - I figured out how to live on my own. I also worked with a lot of ex-military people for my job; it taught me how to communicate with people of different backgrounds.\n\nToday, I work at the University following a career change from my job at Petro-Canada, one of the best decisions I could’ve made. And I would offer this piece of advice: accept the options as they come to you. Never stop looking for opportunities. Don’t worry about failures, there’s always something that comes from there. Everyone will face a significant change at some point. Things can change quickly, but always embrace the opportunities ahead.” If you'd like to read more from Melissa's story for 'Flashback Friday,' click on the following link: http://bit.ly/MelissaLackey", "image": "./photos/1437455517164633510.jpg"}, {"caption": "“Now that you’re close to graduation, do you have any advice for incoming students?” “Academics are important, but sometimes people get bogged down in just school or what looks good on applications. There’s so much more to life. You just gotta live. If that means making mistakes, so be it. One time I struggled into 8am Japanese class hungover, but I had a lot of fun the night before which made it worth it. Just don’t sweat the small stuff. Forgive yourself. If you drive too hard without a break, you might fizzle out and have major problems down the road.” (2/2)", "image": "./photos/1436593171944818684.jpg"}, {"caption": "“My tattoo is a commemoration of my family and how they’ve always given me a sense of belonging. Between 2003 and 2009, I lost all of my grandparents. Growing up, whenever my grandparents would see the Rockies on the horizon they would always comment 'Aren't the mountains pretty today?’, which is what ATMPT stands for. My mom and dad grew up in Calgary, and my family has its roots in Alberta, so the wild rose seemed like a natural choice. My parents both have three sisters as well, which is why we chose the image of The Three Sisters by Canmore. My parents also have this tattoo, and my sister is thinking of getting it soon.\n\nI spent a lot of time with my grandparents. My grandfather used to be an alcoholic. When I needed major hip surgery at the age of six, he completely quit so he could devote himself to caring for me. My grandmother would wake me up for preschool and she would feed me breakfast. She taught me how to knit and was an avid painter. I have one of her paintings in my room now. My grandparents instilled the importance of family and helped me accept who I was, which was my hardest struggle. When I was younger, I had body weight issues and had few friends, so it was tough. I was always worried about how people viewed me, and they showed me the only thing that mattered was what I thought about myself. I forgave myself. I became much more confident in myself and worked on myself. Getting to that point was a struggle, but after that, it got so much better.” (1/2)", "image": "./photos/1436592140036971839.jpg"}, {"caption": "“When I was taking AP Calculus in high school, I fell in love with math and how applicable it can be to the real world. I’ve been working for ATB for over a year, and I would’ve never thought of half the things we do. It’s really about taking the skills I’ve learned in class and using them in a real world application. I noticed that when you’re in a company, you’re driving for success. But we’ve forgotten how important failure is as well. I’ve learned from the leadership at ATB that it’s about giving your team the confidence to take risks and fail. Trying the little, new things rather than going for the same big goals each year. \nI’ve also found a community on campus in the most unlikely of places. My involvement in the solar car team was a complete surprise. I applied for accounting but was asked to run the fundraising and sponsorship sector. We had the opportunity to take our car to New York, and we put Calgary on  the international scale. We happened to be right beside a McLaren P1, and an editor from Ars Technica was more interested in our car than theirs! \nWhen I was being interviewed for ATB, the interviewer asked, “You’re not an engineer, so why are you working on the solar car?” For me, it’s about doing things outside of the box. Even when I picked my degree, I just went for it.”", "image": "./photos/1434471149810941276.jpg"}, {"caption": "Rita Egizii, B. Comm (1996) \"I probably took one of the most unique paths I know of leading up to my undergrad degree. Most people don’t actually believe me when I say that I didn’t go to kindergarten or pre-school.  My education started as a very late Grade 1-er.  As odd as it sounds, my parents were not huge supporters of education...\" If you'd like to read more of Rita's story for 'Flashback Friday,' click on the following link: http://bit.ly/RitaEgizii", "image": "./photos/1434469830492537470.jpg"}, {"caption": "Charlie Fischer, B. Sc. in Chemical Engineering (1971) \"For me, university was so much more than just studying. I would spend most of my lunch hours in MacHall. MacHall brought people together and gave us the opportunity to meet students from different faculties. Oftentimes, after lunch I would join my friends from other faculties and drop in on classes that weren’t typically offered to engineering students. During my summers, I would borrow books on philosophy and religious studies, and anything and everything in between. My experience at the U of C broadened my worldview and solidified my passion for lifelong learning.\n\nI’ve been active at the university for 49 years, and I’ve never stopped working hard or playing hard. Whether it was sitting on the Board of Governors or going back to receive my MBA, I’ve always been able to experience something new each year. When I sat on the Board of Governors, I had the opportunity to work alongside Murray Fraser. Every volunteer hour I put in was worth it to learn from this outstanding individual. He was just a joy. A privilege to get to know. It was such a loss when he passed away, but I know that the university is in good hands.\" If you'd like to read more of Charlie's post for 'Wayback Wednesday,' click on the following link: http://bit.ly/CharlieFischer", "image": "./photos/1434468386318065587.jpg"}, {"caption": "We are excited to announce the release of one of current projects entitled, \"50 Stories From 50 Years,\" where we will post stories from UCalgary alumni every week. Look out for 'Wayback Wednesday' and 'Flashback Friday' over the course of 2017! We hope you enjoy these stories as much as we do!\n\nPlease contact us here if you want to recommend an alumnus or have any questions regarding the project: https://alumniofucalgary.com/contact/", "image": "./photos/1434466292278413816.jpg"}, {"caption": "“I took the ‘Flip Life’ program with AISEC last summer to better understand homelessness. I spent six weeks living in a homeless shelter in Taiwan. It wasn’t as crazy as it seemed, because so many people were normal. But at the same time it was pretty crazy, because there were a lot of underlying mental health issues that hadn’t been addressed. One guy thought there was a government conspiracy to kill him, and that the song ‘Firework’ by Katy Perry was warning him of the plot. It was an eye-opening experience. Even though the homeless shelter there was understaffed and underfunded, the workers were all amazing. They tried to take us volunteers out to do fun activities. It sounds cheesy, but volunteering is really good for the soul. I’m more empathetic, and honestly my bed is the most comfortable place to be after sleeping on the floor and a dirty mattress with a weird black stain for weeks.\n\nBut I also learned it is very important to focus on supporting the people with the means to make a significant and sustainable change, like mental health professionals. Being a volunteer is gratifying, but at the end of the day, we aren’t the biggest players in changing these people’s lives. Volunteering in Taiwan gave me a new perspective in that as much as I wanted to help, without the education and relevant experience, I couldn’t give much more than a new item of clothing or share a funny joke with those living in the shelter. We all want to help, but it should be recognized that there is always more to it than what’s on the surface.”", "image": "./photos/1429442245618373853.jpg"}, {"caption": "“I had my first New Year’s kiss in New York City.\n\nMy best friend and I made a pact to study abroad together. In our third year, we saw a pamphlet for the Broadway course in NYC and we decided to save up money and go. It was a dream come true. We both love acting and drama, so it felt so good to soak in the jazz bars and Broadway shows and culture of the city.\n\nI feel like love has sneaky ways of finding you. There was a boy on the trip, who I’d briefly met during orientation for the class. He was so cute. I thought he was way out of my league, so I never thought anything would happen. We got to hang out in NYC and the more we talked I realized he was pretty much the sweetest person I’d ever met. It was New Year’s Eve and our group just left the restaurant. He was keeping my hands warm, and when it was time for the countdown, we rushed out into Times Square. We kissed, and I looked up and confetti was falling and Louis Armstrong’s ‘What a Beautiful World’ was playing. I was just like, wow!”", "image": "./photos/1429441478840829400.jpg"}, {"caption": "“My first video was for my high school’s morning announcements. They used to show announcements on PowerPoint slides, and I thought, wouldn’t it be interesting if these were videos instead? Over the past few years, I’ve filmed everything from TV commercials for ski hills and small businesses, to the U of C Website and even my hometown of Trail, BC for tourism.\n\nEvery video is a new field trip. I’m like a sherpa, I carry all of my equipment. I get to see a lot of behind-the-scenes action, and talk to people that I ordinarily would never meet. I like doing it solo because I see film-making like creating a painting - I decide on the message, the shots, the editing, the music. I wouldn’t want anyone else to finish my half-finished painting. I’ve been very fortunate to have lots of creative freedom.”", "image": "./photos/1429440073329685279.jpg"}, {"caption": "\"My first name, Oleg, is Russian, my family is Korean, and I was born in Kazakhstan. If a Kazak has a Russian name, he is Korean. That’s something quirky about the culture there.\n\nI am from Almaty, a pretty city in the mountains. My area was not dangerous, but it was not safe. There was lots of bullying, so I became involved in martial arts to protect myself. This quickly became my first passion in life. I did taekwondo, and then boxing and jujitsu. I knew a lot of people in Kazakhastan who struggled with money, so I learned how to save money on hobbies. When I moved to Canada for boarding school, I found a lot of companies that offered free memberships or promotions at their martial arts gyms. In my two years of high school, I did martial arts pretty regularly but I only paid for three days. And even that was discounted!\"", "image": "./photos/1429438922957901794.jpg"}, {"caption": "“I was on vacation in the Dominican last summer. The Dominican people are the most respectful, selfless people I have ever met. It made me so angry to see how poorly some of the tourists treated the staff. I know what it’s like - I worked at Victoria’s Secret and customer service is hard. Sure the tourists pay a lot of money, and sure it’s the job of the staff to take care of them. But it just hurt to see people treated like they were worth less than others. Everyone should have to work in retail or service at least once in their life.”", "image": "./photos/1429437202244794475.jpg"}, {"caption": "Welcome to Humans of UCalgary! Sharing the diversity and beauty of the UCalgary community.", "image": "./photos/1429436739931743024.jpg"}]