[
    {
        "image":"../img/Layton.jpg",
        "text":"Hello world this is the best thing ever"
    },
    {
        "image":"3.jpg",
        "text":"There have been many times during university where I’ve felt lost. The first time I applied to med school, I was rejected. I wasn’t able to achieve my most important goal, which made me stop and rethink whether I was a right fit for it.\n My mom noticed my self doubt and gave me really great advice - never chase after success. Instead, she told me to pursue what interested me, in order to give it all of my attention and effort. I’ve applied this to so many aspects of my life through introspection. Everything from my career goals, to my personal goals, to my hobbies. Now, I’ve gone one step further with the realization that failure is just another part of life. If you face failure with the right attitude and keep trying and trying and trying, you will succeed.\nI did exactly what my mom told me to do.\nThis fall, I will be attending med school at the University of Alberta. (2/2) "
    },
    {
        "image":"2.jpg",
        "text":"I had my first New Year’s kiss in New York City.My best friend and I made a pact to study abroad together. In our third year, we saw a pamphlet for the Broadway course in NYC and we decided to save up money and go. It was a dream come true. We both love acting and drama, so it felt so good to soak in the jazz bars and Broadway shows and culture of the city. I feel like love has sneaky ways of finding you. There was a boy on the trip, who I’d briefly met during orientation for the class. He was so cute. I thought he was way out of my league, so I never thought anything would happen. We got to hang out in NYC and the more we talked I realized he was pretty much the sweetest person I’d ever met. It was New Year’s Eve and our group just left the restaurant. He was keeping my hands warm, and when it was time for the countdown, we rushed out into Times Square. We kissed, and I looked up and confetti was falling and Louis Armstrong’s ‘What a Beautiful World’ was playing. I was just like, wow!"
    },
    {
        "image":"1.jpg",
        "text":"My first name, Oleg, is Russian, my family is Korean, and I was born in Kazakhstan. If a Kazak has a Russian name, he is Korean. That’s something quirky about the culture there. I am from Almaty, a pretty city in the mountains. My area was not dangerous, but it was not safe. There was lots of bullying, so I became involved in martial arts to protect myself. This quickly became my first passion in life. I did taekwondo, and then boxing and jujitsu. I knew a lot of people in Kazakhastan who struggled with money, so I learned how to save money on hobbies. When I moved to Canada for boarding school, I found a lot of companies that offered free memberships or promotions at their martial arts gyms. In my two years of high school, I did martial arts pretty regularly but I only paid for three days. And even that was discounted!"
    }
]